[
  {
    "_id": "64c88918a437e7743e95b04d",
    "layout": "section-head",
    "title": "Metaphysics",
    "subtitle": "The uncertainty of high-level abstractions.",
    "file_name": "metaphysics",
    "parent_node": "dimensions-of-uncertainty",
    "num_child_nodes": 4,
    "visibility": true,
    "tags": [
      "metaphysics"
    ],
    "content": "<p>Perhaps we became humans when we started burying our dead. Prehistorically, that was the moment when we first addressed our <strong><em>metaphysical uncertainty</em></strong> by asking these original questions: Who are we? Where do we come from? And where do we go? Finding answers to these questions is hard, but the attempt at doing so is part of our human heritage. Unfortunately, the confusion starts at the word metaphysics, and it goes back a long time. The term originally refers to a book by Aristotle who referred to it as πρώτη φιλοσοφία : <strong><em>first philosophy</em></strong>. A later scholar called Andronicus of Rhodes took it upon himself to creatively rename the book τὰ μετὰ τὰ φυσικὰ βιβλία : <strong><em>the books after physics</em></strong>, because he had placed it after the books on physics in his anthology. Unfortunately, this editorial mistake survived and was later taken too literally by medieval scholars. Thomas Aquinas thought metaphysics should only be taught to students <strong><em>after</em></strong> they had mastered physics, and others interpreted the title to mean <strong><em>beyond</em></strong> the physical realm. Centuries later, we are still saddled with these misunderstandings. </p>\n<p>The word metaphysics carries otherworldly associations of mysticism, magic, and magnetism. Its mere mention makes some people reach for their pistol 🔫 . This sorry state of affairs is as unfortunate as it is groundless. Metaphysics is simply one of the four main branches of philosophy, along with epistemology, logic, and ethics. This branch studies the fundamental nature of reality. If this sounds a bit woo-hoo to you, then I would like to address it thus: If astronomy studies the properties of objects moving through space, then metaphysics explores what it means to be an <strong><em>object</em></strong>, what a <strong><em>property</em></strong> is, and why both exist in a topological entity called <strong><em>space</em></strong>. Nothing strange or otherworldly here. Just science.</p>\n<p>And this is how the term metaphysics will be used going forward in this book. Not as a realm beyond the physical, but as practical inquiry into the first principles of reality. It is simply an exploration of the high-level abstractions we hold about the physical world around us as well as the inner world of symbolic constructs of our own cognition. </p>\n<h3 id=\"metaphysicsmetaphysics\">[[metaphysics|Metaphysics]]</h3>\n<blockquote>\n  <p>[[myth|Myth]] - <em>Answers to metaphysical uncertainty.</em>\n  [[death|Death]] - <em>Eros and Thanatos.</em>\n  [[jung-quote-red-book| C. G. Jung quote]]\n  [[two-worlds|Two Worlds]] - <em>Mind and matter.</em></p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "myth",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b04e"
      },
      {
        "name": "death",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b050"
      },
      {
        "name": "jung-quote-red-book",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b052"
      },
      {
        "name": "two-worlds",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b054"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:50.385Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05e",
    "layout": "page",
    "title": "Myth",
    "subtitle": "Who am I? And why am I here?",
    "file_name": "myth",
    "parent_node": "metaphysics",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "metaphysics"
    ],
    "content": "<p>According to Joseph Campbell, we have always answered metaphysical questions through <strong><em>myths</em></strong>.[1] However, these myths have undergone dramatic changes. Starting in the upper Palaeolithic, hunter gatherer societies lived according to the <strong><em>way of the animal powers</em></strong>. All of nature was infused with divine presence and shamans mediated between spirits and humans, defending life, health, and fertility against death, diseases, and disaster. Each culture's main hunting animal took the center stage in this ritual of sacrifice and renewal. Man and animal partook as equals in an eternal dance of divine life.[2]</p>\n<p>Then, in around 10,000 BCE, the end of the last ice-age ushered in the agricultural age. The soil became the center of our universe. Mother Earth with life-giving powers. The annual cycle of planting, growing, and harvesting of crops according to the seasons took center stage in a repetitive rhythm of life and death. A Great Goddess was both creator and destroyer of life, usually paired with a son or consort. An every-dying, ever-resurrecting lesser male God. For millennia, we lived according to the <strong><em>way of the seeded earth</em></strong>. </p>\n<p>Around 3,000 BCE, the first high civilizations in China, India, and Mesopotamia changed all that. They turned their gaze away from the soil, and toward the sky. As they learned to interpret the night sky to predict the seasons, they founded the <strong><em>way of the celestial lights</em></strong>. In this mythology, a sun king with a radiant crown became the center of the cosmos. His court, the orbiting planets in the clockwork universe of an eternal cosmic play.[3]</p>\n<p>This mythology has undergone many iterations. Many a warrior god has come and gone, smiting us with thunder, flood and pestilence. Yet, we are still infused with all above mythological systems. Today, many still appeal to spirits and divinities for fertility or success. Legions partake in rituals re-enacting the death and resurrection of a male god. Countless others live in societies controlled by sun kings in all but name, orchestrating masses with clockwork precision while crushing the formidable power of an age old rival - female fertility.[4]</p>\n<p>These myths are still very much with us today. And to all you hard-nosed empiricists shrugging your shoulders right now, ask yourselves this: what are you really doing when you read bedtime stories of fairy-magic to your children? When you put up a Christmas tree, or display your status through a three-pointed star on the hood of your car? What are you re-enacting when you surrender most of your waking life to the god of productivity, or idolize a radiant prophet of wealth and success with ten million followers on Instagram? In all these cases, you are partaking in an age-old mythological narrative. A narrative established in response to the <strong><em>deepest kind of uncertainty</em></strong>. You are enacting a play, formulated to answer a metaphysical question: Who am I? And why am I here?</p>\n<hr>\n<p>[1] Campbell, Joesph. The Power of Myth\n[2] Campbell, Joseph. Historical Atlas of World Mythology. Vol. 1: The Way of the Animal Powers\n[3] Campbell, Joesph. The Hero with a Thousand Faces \n[4] Eliade, Mircea. Shamanism, Archaic Techniques of Ecstasy.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:20.987Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00e",
    "layout": "page",
    "title": "Fore-Casting",
    "subtitle": "Prediction as uncertainty minimization.",
    "file_name": "casting",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Uncertainty manipulation also happens through <strong><em>(fore)casting</em></strong>. By that I mean casting a bet. All our manifold attempts at <strong><em>pre-dicting</em></strong> the uncertain future. Gambling, weather forecasting, and speculating on forex, commodity, or the stock exchange are prime examples. But casting reaches far deeper into everyday life. All project management and decision-making are ultimately bets on future outcomes. Especially because much of our economic activity is subject to expectations of future reward. In the words of anthropologist Mary Douglas:</p>\n<blockquote>\n  <p>“<em>An individual can expect to get future rewards only if he can reasonably suppose that those in his debt will be in a position (and somehow obliged) to repay him. If he has to adapt to uncertainty, he will be wise to cancel those expectations. If a whole society starts to adapt to general uncertainty, its future will be stripped of anticipated returns.</em>” [1]</p>\n</blockquote>\n<p>For this reason, much of our daily activity depends on expectations of predictable outcomes. And so here we find another domain in which uncertainty is very much unwelcome. It needs to be banished and eliminated for the sake of certainty. All predictive activity carries the expectation of minimized uncertainty. It requires our maps and models to coincide with a static reality. </p>\n<hr>\n<p>[1] Douglas, Mary. Risk and Culture: An Essay on the Selection of Technological\nand Environmental Dangers</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:29.205Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b011",
    "layout": "page",
    "title": "Cognition",
    "subtitle": "Encoding uncertainty in the brain.",
    "file_name": "cognition",
    "parent_node": "evolution",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "evolution",
      "cognition"
    ],
    "content": "<p>Uncertainty is wet-wired into the predictive processing that happens in the brain. According to a view that is rapidly becoming dominant in the cognitive sciences, the brain is not a passive filter of sensations, but an active inference organ that generates hypotheses that are tested against sensory evidence. Karl Friston, a British neuroscientist at the University College London, calls it a <strong><em>fantastic organ</em></strong>, from the greek phantastikos: the ability to create mental images. This means that our brain actively builds a predictive model of the world, constantly checking it against sensory input. In order to minimize surprise, our brain is organized into recursive feedback loops of predictions and sensory input verification.[1]</p>\n<p>According to Friston, these feedback loops include dedicated channels for what he calls gain control. Gain control is a channel that applies a specific weight to each prediction. This weight indicates <strong><em>how confident a prediction is</em></strong>. A low weight represents a highly tentative guess - a speculative hunch at best. A high weight means a prediction is a highly certain one - one that is expected to come true. This process of weighting predictions is <strong><em>meta-predictive</em></strong>. It makes predictions about predictions. We could say that this process tags predictions by their degree of certainty. By inverting this statement we can also say that our brain uses this process to <strong><em>encode uncertainty</em></strong>. From this perspective, the element of uncertainty is the key component in the fantastic organ that is our brain. It is the meta-ingredient that makes our cognition possible.</p>\n<p>This is true not only for humans, but for all animals with a complex nervous system. Probably from reptiles, amphibians, and  upwards, but certainly for mammals, cetaceans, birds, and cephalopods. The importance of this for our understanding of uncertainty is hard to overstate. It means that the integration of information about uncertainty in the brain was (and is) crucial in the arena of natural selection. In other words, the evolution of higher-order organisms, let's say anything above worms, was enabled by the evolution of meta-predictive processes in the brain that encode uncertainty. At least since the Cambrian Explosion[2], the evolution of animals has been driven, in part, by the quality of uncertainty encoding in their brain.</p>\n<hr>\n<p>[1] Kanai R, Komura Y, Shipp S, Friston K. 2015 Cerebral hierarchies: predictive processing, precision and the pulvinar. Phil. Trans. R. Soc. B 370: 20140169. http://dx.doi.org/10.1098/rstb.2014.0169\n[2] Cambrian Explosion wiki entry and link</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:15.274Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b057",
    "layout": "page",
    "title": "The Past",
    "subtitle": "Re-interpreting bygones.",
    "file_name": "past",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>Some view the past as bathed in the golden glow of timeless glory. A time in which founders and heroes shaped our identity with prophetic hands. Others see the past as crude habitat of our primitive forebears. Savages living archaic lives that were nasty, brutish, and short. Both of these views are equally absurd, but perhaps not for the reasons most apparent to us. For one, they do not stand up to scrutiny by historians and archeologists. But also, these views make a false assumption that is all too common. They view the past as a <strong><em>settled historical fact</em></strong>. Something fixed and static. Frozen objects, gradually receding in the rearview mirror, driven by the unrelenting forward motion of time. But past events are not distant monoliths of questionable relevance. As we have seen in the previous section on [evolution], they are the raw material from which we manufacture a precious commodity: <strong><em>Prediction and choice</em></strong>. </p>\n<p>The past is a malleable material because our choices are based on the <strong><em>beliefs</em></strong> we hold about it. Beliefs shaped from partial knowledge, cognitive biases, and arbitrary interpretations. Like looking at random blotches of ink on a paper, the image we perceive is not a historical fact. It is the Rorschach projection of ourselves onto a canvas. Our value system, identity, and decision-making are all based on these <strong><em>interpretations</em></strong> of the past. Interpretations fraught with uncertainty. If you have ever experienced or learned something new that utterly re-shaped your understanding of the past, then you know how acutely profound this feels in the present. It can be a simple aha-moment, or a life-changing realization affecting your sense of identity. </p>\n<p>The past is not a monolithic mass, frozen in time. It is an endlessly changing space full of surprises, obscuring and revealing, pregnant with possibility. To master the <strong><em>art of uncertainty</em></strong>, we need to remain open to re-interpreting bygones, for they have not truly gone-by. Because our knowledge of the past is partial, every new thing we learn about it has the potential to change our present. Whether we like it or not, we participate in a fitful yet fertile dance with the dynamic past. For it holds the key to our future.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:24.825Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b018",
    "layout": "section-head",
    "title": "The Dimensions of Uncertainty",
    "subtitle": "An outline of the roots of uncertainty.",
    "file_name": "dimensions-of-uncertainty",
    "parent_node": "first-principles",
    "num_child_nodes": 4,
    "visibility": true,
    "tags": [
      "section-head",
      "meta"
    ],
    "content": "<p>We have barely begun our exploration of uncertainty, but one thing is already crystallizing. Our common sense understanding of uncertainty as lack of knowledge or predictability is misleading at best. It does not even begin to capture the width and breadth of its influence on almost every domain of life. Agency, creativity, science, and society all respond to uncertainty in varying degrees. Our attitude toward it shapes the choices available to us: The possibility space of our actions and knowledge. Uncertainty is the thread running through our ideas, hopes, and perceptions. It is a most fundamental component of life. Yet, because of its intangible nature, we rarely speak or think of it.</p>\n<p>My claim is that uncertainty is a special relationship between an agent and a surrounding negative space. The rest of this book will be spent clarifying this statement and exploring the four domains in which this relationship is constitutive of a greater whole: [knowledge], [agency], [creativity], and [meaning]. But we are not quite ready for this deep-dive into what uncertainty really <strong><em>is</em></strong>, yet. First, we must explore where it comes <strong><em>from</em></strong>. The various domains from <strong><em>where</em></strong> its influence is established. To do this, I have to perform a delicate dance by briefly touching on many topics across a broad scope.</p>\n<p>This section will look at how uncertainty is rooted in <strong><em>evolutionary</em></strong> dynamics. How our mythology historically addressed our <strong><em>metaphysical</em></strong> uncertainty. How <strong><em>society</em></strong> is an attempt to reduce, or at least systematically arrange uncertainty. And lastly, how uncertainty is affected by our interaction with <strong><em>space</em></strong> and <strong><em>time</em></strong>.</p>\n<p>To sketch an outline of these <strong><em>roots of uncertainty</em></strong>, I have to breeze past eminent subjects, barely slowing down for a breather. While this admittedly cavalier treatment might raise eyebrows, it is necessary in my cartographic attempt at drawing a global map of where uncertainty is situated. This can certainly be refined and expanded in the future, but for now I will limit myself to general outlines and the location of dangerous beasts. Beware, wary traveler, <em>hic sunt dracones</em>. </p>\n<hr>\n<h3 id=\"dimensionsofuncertaintydimensionsofuncertainty\">[[dimensions-of-uncertainty|Dimensions of Uncertainty]]</h3>\n<h3 id=\"sections\">Sections</h3>\n<p>[[evolution|Evolution]] - <em>Embodied knowledge.</em>\n[[metaphysics|Metaphysics]] - <em>First principles.</em>\n[[society|Society]] - <em>Systematic arrangements of uncertainty.</em>\n[[spacetime|Spacetime]] - <em>Dynamic entanglement with time and space.</em></p>",
    "child_nodes": [
      {
        "name": "evolution",
        "num_grandchild_nodes": 4,
        "_id": "64c88918a437e7743e95b019"
      },
      {
        "name": "metaphysics",
        "num_grandchild_nodes": 4,
        "_id": "64c88918a437e7743e95b01b"
      },
      {
        "name": "society",
        "num_grandchild_nodes": 13,
        "_id": "64c88918a437e7743e95b01d"
      },
      {
        "name": "spacetime",
        "num_grandchild_nodes": 11,
        "_id": "64c88918a437e7743e95b01f"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:35.836Z",
    "node": {
      "num_grandchild_nodes": 11
    }
  },
  {
    "_id": "64c88918a437e7743e95b010",
    "layout": "page",
    "title": "Competition",
    "subtitle": "A fog of greater or lesser uncertainty.",
    "file_name": "competition",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>In purely game theoretic terms, <strong><em>competition</em></strong> is a zero-sum rivalry between parties over finite resources. However, there is something more subtle at play. For it is here that we find the first <strong><em>positive</em></strong> manipulation of uncertainty. Whereas in the domains&nbsp;of control, (fore)casting, and causality, uncertainty was actively eliminated or drastically reduced, competition calls for its careful manipulation or even creation. In sales, marketing, public relations, and politics, disinformation is used as competitive weapon against an opponent. <strong><em>Fear, uncertainty, and doubt</em></strong> (FUD) are artificially generated for the audience to seek shelter in a carefully crafted safe-heaven, e.g. a branded product, an incumbent political candidate, or policy choice. Less pernicious examples are price negotiations in which one side benefits from an information asymmetry, and sports tactics where the opponent gains a competitive advantage through deception. However, nowhere is the intimate liaison between conflict and uncertainty better understood than in military strategy. From Sun Tzu to von Clausewitz, the fog of war is a requisite for victory. The latter writes:</p>\n<blockquote>\n  <p>“<em>War is the realm of uncertainty; three quarters of the factors on which action in war is based are wrapped in a fog of greater or lesser uncertainty. A sensitive and discriminating judgment is called for; a skilled intelligence to scent out the truth.</em>” [1]</p>\n</blockquote>\n<p>In the fog of war, nothing benefits one adversary more than the uncertainty of the other. What the above tactics rely on is the elimination on one side, and the selective manufacturing and deployment of uncertainty on the other. This artful manipulation forms a meticulously crafted asymmetry of the unknown for the benefit of one party. A successful war strategy uses the playbook of adaptation: flux, subterfuge, and the element of surprise; to thwart an opponent’s structures of stasis: control and prediction.</p>\n<hr>\n<p>[1] Carl Von Clausewitz. On War. 1832. S.L., Repeater, 2019.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:30.043Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b056",
    "layout": "quote",
    "title": "Molly's Song",
    "subtitle": null,
    "file_name": "mollys-song",
    "parent_node": "evolution",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<p>Who has choices need not choose.\nWe must, who have none.\nWe can love but what we lose -\nWhat is gone is gone.</p>\n<p>~ Peter S. Beagle, The Last Unicorn</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:14.426Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b062",
    "layout": "page",
    "title": "Space",
    "subtitle": "Spacial uncertainty.",
    "file_name": "space",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>Space. The final frontier. These are the voyages of the Starship Enterprise… just kidding. Space is fundamental to our existence. Where we are, what we sense around us, and how we experience it forms the basis of the perceptual field that is our reality. We perceive only a fraction of our immediate surroundings, and with increasing distance other places are, literally, unknown territory. To understand what happens elsewhere, we rely on maps, measurements, and third-party accounts. But down yonder, uncertainty reigns supreme. The cause of this <strong><em>space uncertainty</em></strong> lies in the limitations of our micro-localized perspective. In our preference for human-scaled objects and the gradual discounting of things with increasing distance. But it also lies in the confusion caused by the overlap of objective, measurable space and the space of our subjective experience.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:22.679Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b023",
    "layout": "page",
    "title": "Epistemic Lenses",
    "subtitle": "The different frameworks we use to understand uncertainty.",
    "file_name": "epistemic-lenses",
    "parent_node": "the-beast",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "epistemic"
    ],
    "content": "<p>Paradoxically, the difficulties in understanding uncertainty are due to its colossal reach. The breadth of domains affected by uncertainty are vast. Anywhere from philosophy to physics, economics to psychology, computer science to anthropology, R&amp;D to art, uncertainty has been a (sometimes hot) topic of debate since the 20th century. This is a welcome change after centuries of utter neglect and has yielded great insights in many domains. However, the sheer magnitude and extent of this topic has led to a <strong><em>fractured</em></strong> understanding. A kaleidoscope of different epistemic lenses. </p>\n<blockquote>\n  <p>In <strong><em>thermodynamics and information theory</em></strong>, uncertainty is studied in the form of entropy or randomness. </p>\n  <p>In <strong><em>particle physics</em></strong>, it is understood as standard deviation of position or momentum, denoted by 𝚫. </p>\n  <p>In <strong><em>economics</em></strong>, uncertainty is often equated with risk - the probability of events affecting expected-utility maximization. </p>\n  <p>In <strong><em>philosophy</em></strong>, uncertainty is epistemic in nature - a factual or irreducible ignorance as obstacle to knowledge. </p>\n</blockquote>\n<p>These examples highlight the many different definitions of uncertainty based on the domain specific perspective. How can we talk about uncertainty if this word carries so many different meanings? One objective of this book is to establish a common vocabulary for us to discuss uncertainty across domains. We may disagree with each other, but in order to talk about uncertainty, we first need an epistemic commons that allows shared sense-making about this topic as a whole.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:35.342Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05b",
    "layout": "page",
    "title": "The Present",
    "subtitle": "Clock-time and lived-time.",
    "file_name": "present",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>In our understanding of the present, too, misunderstandings abound. We tend to view the present moment as fleeting. Like the white rabbit, racing and skipping ahead through the enchanted forest, glancing at his pocket watch, fitful and flitting - yet never captured. As noted by the godfather of phenomenology, Henri Bergson, this misunderstanding stems from our confusion about how things are <strong><em>measured</em></strong>, versus how they are <strong><em>experienced</em></strong>. We measure time in fractions of planetary rotation - seconds, minutes, hours. But that is not how we experience it. There is a distinction between <strong><em>clock time</em></strong> and <strong><em>lived time</em></strong>. Bergson pointed out that time is experienced in <strong><em>real duration</em></strong> (\"durée réelle\"), individual moments that seamlessly blend into one another. Music is a prime example. Beethoven's Opus 27, Nr. 2, also called the <em>Moonshine Sonata</em>, is nothing but a bunch of frequencies that change over time. However, what we perceive are delicate harmonies of deep anguish. We hear the melancholy sound of a dismal and dejected man, played in the key of a broken heart. </p>\n<p>This discrepancy between <strong><em>objective measurement</em></strong> and <strong><em>subjective experience</em></strong> is a great source of uncertainty and confusion. It has driven a wedge between science and politics, society and institutions, traditionalists and progressives. Yet, both are equally real. Their boundaries are blurry and permeable. The Art of Uncertainty lies in acknowledging, both, the <strong><em>objective truth</em></strong> of metrics and the <strong><em>poetic truth</em></strong> of experience. We must see the limitations of each and learn when to use which. Perhaps we can learn to observe the present moment, and appreciate it from a perspective untraveled by time.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:25.693Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b02e",
    "layout": "section-head",
    "title": "Equivocation",
    "subtitle": "All that which uncertainty is NOT.",
    "file_name": "equivocation",
    "parent_node": "first-principles",
    "num_child_nodes": 7,
    "visibility": true,
    "tags": [
      "section-head",
      "semiotic",
      "meta"
    ],
    "content": "<p>Because of the [boundaries] problem of the term \"uncertain,\" we often make the mistake of <strong><em>equivocation</em></strong>. In logic, equivocation is a fallacy resulting from a word being used to express different meanings. For example, we use the word \"jackass\" to refer to a specific type of furry mammal with long ears, but we also use it to refer to a specific type of motorist, having abruptly cut into our lane at the intersection. Likewise, we use the word \"uncertain\" to express many different meanings. This is confusing and ultimately leads to misunderstandings. Therefore, this section is about (re)drawing boundaries and separating concepts that should not be equivocated. This <strong><em>via negativa</em></strong>, or way of denial, will help us exclude all that which uncertainty is <strong><em>not</em></strong>. This is a necessary step to work our way inward and peel back the layers until we find the core meaning of uncertainty itself.</p>\n<hr>\n<h3 id=\"equivocationequivocation\">[[equivocation|Equivocation]]</h3>\n<blockquote>\n  <p>[[ignorance|Ignorance]] - <em>Absence of something.</em>\n  [[denicola-quote|DeNicola quote]]\n  [[FUD|FUD]] - <em>Fear, uncertainty, and doubt.</em>\n  [[practical-certainty|Practical Certainty]] - <em>Credence, belief, trust, and choice.</em>\n  [[timothy-morton-quote|Timothy Morton quote]] \n  [[risk|Risk]] - <em>Resolvable versus radical uncertainty.</em>\n  [[probability|Probability]] - <em>Knowledge of distributions.</em>\n  [[utility-functions|Utility functions]] ==WRITE==\n  [[understanding-and-prediction|Understanding and Prediction]] ==WRITE== (human prediction as imaginal, fictional excess)</p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "ignorance",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b02f"
      },
      {
        "name": "denicola-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b031"
      },
      {
        "name": "FUD",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b033"
      },
      {
        "name": "practical-certainty",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b035"
      },
      {
        "name": "timothy-morton-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b037"
      },
      {
        "name": "risk",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b039"
      },
      {
        "name": "probability",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b03b"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:43.898Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b04a",
    "layout": "quote",
    "title": "James P. Carse Quote",
    "subtitle": null,
    "file_name": "james-carse-quote-2",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<blockquote>\n  <p>\"Since culture is itself a poiesis, all of its participants are poietai—inventors, makers, artists, storytellers, mythologists. They are not, however, makers of actualities, but makers of possibilities. The creativity of culture has no outcome, no conclusion. It does not result in art works, artifacts, products. Creativity is a continuity that engenders itself in others.\"</p>\n</blockquote>\n<p>~ James P. Carse, Finite and Infinite Games - A Vision of Life as Play and Possibility.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:31.332Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b07b",
    "layout": "quote",
    "title": "Timothy Morton Quote",
    "subtitle": null,
    "file_name": "timothy-morton-quote",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<p>“<em>Automation means prolonging the past for the sake of what is now called ‘certainty’. Predictable profit. Predictable growth. Predictable planet death. Good to know that will happen in advance. Creativity means uncertainty. It means you might not know whether your plan is right. It means knowing that your plan can never be perfectly right. It will always have a flaw. Your economics, your ecology. It will never map earth perfectly. Never one to one. How wonderful is that. Acknowledging finitude. To exist is to be flawed. To be broken. To be wounded.</em>”[1]</p>\n<hr>\n<p>[1] Timothy Morton. Lecture to the UF School of Art + Art History. https://m.youtube.com/watch?v=P4oNrE1zPZY (9th minute)</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:17.880Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b07d",
    "layout": "section-head",
    "title": "Society",
    "subtitle": "Systematic arrangements of uncertainty",
    "file_name": "society",
    "parent_node": "dimensions-of-uncertainty",
    "num_child_nodes": 13,
    "visibility": true,
    "tags": [
      "section-head",
      "social"
    ],
    "content": "<p>Societies are cohorts of people sharing a suite of protocols that enable collective decision-making and coordinated behavior. These protocols are social technologies that structure the economy, governance, currencies, institutions, and property, but they also manage a shared identity, reputation, historical narratives, and mythology. These tools facilitate sense-making and promote confidence in a predictable future. From this perspective, society serves the purpose of <strong><em>uncertainty reduction</em></strong>. It allows the interaction and collaboration with in-group strangers through shared social norms. Everything from names, clothing, speech, etiquette, food, and beliefs are strictly codified to avoid the uncertainty of interacting with others. What we call <strong><em>culture shock</em></strong> is simply the interaction with a society that encodes different rules. </p>\n<p>But uncertainty reduction is not all that takes place in society. More accurately, societies <strong><em>manipulate and arrange</em></strong> uncertainty for their purposes, concealing and suppressing it here, creating and accentuating it there. However useful these social technologies can be for group coordination, we must guard against their ability to create <strong><em>illusions of certainty</em></strong>. To mask uncertainty and deceive us into a false belief in their ability to control and predict. That is the topic of this section.</p>\n<hr>\n<h3 id=\"societysociety\">[[society|Society]]</h3>\n<blockquote>\n  <p>[[relationship|Relationship]] - <em>Our relationship with uncertainty through the ages.</em>\n  [[control|Control]] - <em>Sovereignty, authority, and legitimacy.</em>\n  [[elmyra|Elmyra Duff]] - <em>Ritual of destruction.</em>\n  [[shoshana-zuboff-quote|Shoshana Zuboff quote]]\n  [[casting|Fore-Casting]] - <em>Pre-dicting an uncertain future.</em>\n  [[causality|Causality]] - <em>Post-diction as uncertainty reduction.</em>\n  [[competition|Competition]] - <em>Manipulation of uncertainty.</em>\n  [[culture|Culture]] - <em>Desired states of vulnerability.</em>\n  [[creativity-6C|Creativity]] - <em>The endless creation of possibilities.</em>\n  [[james-carse-quote-2|James Carse quote]]\n  [[uncertainty-continuum|The Uncertainty Continuum]]\n  [[duality|The Duality of Uncertainty]]\n  [[Rot-at-the-Core|Rot at the Core]] - <em>The meta-crisis of meaning.</em></p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "relationship",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b07e"
      },
      {
        "name": "control",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b080"
      },
      {
        "name": "elmyra",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b082"
      },
      {
        "name": "shoshana-zuboff-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b084"
      },
      {
        "name": "casting",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b086"
      },
      {
        "name": "causality",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b088"
      },
      {
        "name": "competition",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b08a"
      },
      {
        "name": "culture",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b08c"
      },
      {
        "name": "creativity-6C",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b08e"
      },
      {
        "name": "james-carse-quote-2",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b090"
      },
      {
        "name": "uncertainty-continuum",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b092"
      },
      {
        "name": "duality",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b094"
      },
      {
        "name": "Rot-at-the-Core",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b096"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:48:07.798Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b046",
    "layout": "page",
    "title": "Ignorance",
    "subtitle": "The emptiness we call ignorance.",
    "file_name": "ignorance",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "epistemic"
    ],
    "content": "<p>Uncertainty appears to be related to knowledge. It speaks of knowledge that is amiss, faulty, vague, or out of reach. Something <strong><em>beyond our ken</em></strong> (from middle English \"kennen\", to know). This absence is what we call <strong><em>ignorance</em></strong>, and we often use it interchangeably with uncertainty. But are they the same thing? This is the domain of epistemic philosophy, from the greek <em>epistēmē</em> for knowledge. Unfortunately, western philosophy has been obsessed with <strong><em>certain knowledge</em></strong> and the eradication of ignorance and uncertainty. For centuries, eminent minds have mistaken ignorance for emptiness and focused on knowledge instead. Not so in the eastern world. Chinese philospher Laozi wrote 2,500 years ago:</p>\n<blockquote>\n  <p>“<em>We join spokes together in a wheel, but it is the center hole that makes the wagon move. We shape clay into a pot, but it is the emptiness inside that holds whatever we want. We hammer wood for a house, but it is the inner space that makes it livable. We work with being, but non-being is what we use.</em>”[1]</p>\n</blockquote>\n<p>This emptiness we call ignorance has a quality philosophers call <em>intentionality</em>. To be ignorant is to be ignorant of <strong><em>something</em></strong>. As negative space it is important on an abstract, as well as practical level. As Laozi noted, holes are more than just negative space. Via a pin, bolt or screw, these holes fasten together planes, trains, and automobiles. A doughnut is a doughnut because of its hole. Silence is the absence of sound, drought the absence of water. Emptiness is <strong><em>something</em></strong>. It has a structure, a quality and a substance. The first to write about the importance of ignorance in the west was 15th Century German polymath Nicholas of Cusa. His famous work <em>De Docta Ignorantia</em> (Of Learned Ignorance) is dedicated to the idea that wisdom is best achieved by learning about our own ignorance:&nbsp;</p>\n<blockquote>\n  <p>“<em>The true essence of things is unobtainable in its pure form. It was sought by all philosophers, and found by none. By deepening our study of this ignorance, we draw near to the truth.</em>”[2]</p>\n</blockquote>\n<p>More recently, the study of ignorance and uncertainty has become more widespread due to practical applications in cognitive psychology, decision theory, sociology of organizations, risk management, economics, and AI. Also, the study of ignorance has blossomed because of discoveries in science that showed how absolute truth and certainty are impossible. Discoveries in quantum physics have yielded irreducible uncertainty on the micro-scale, and Gödel's famous 1931 paper proved that absolute certainty is unobtainable even in mathematics.[3]</p>\n<p>We will return to the topic of knowledge and ignorance elsewhere, but for now I submit the following: ignorance is an important, multifaceted, and irreducible aspect of our interaction with the world. It describes our relationship with potential knowledge. This is important and the concept of ignorance has a relationship with uncertainty. However, as you will see going forward, uncertainty goes far beyond that. Although semantically related, <strong><em>ignorance is not uncertainty itself</em></strong>.</p>\n<hr>\n<p>[1] Tzu, L., &amp; Mitchell, S. (2006). Tao Te Ching: A New English Version (Perennial Classics) (Reprint ed.). Harper Perennial Modern Classics.\n[2] Nicolai de Cusa, De Docta Ignorantia, Book 1, Chapter 3 (translation of the author)\n[3] Michael Smithson, Ignorance and Uncertainty: Emerging Paradigms</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:15.790Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b04c",
    "layout": "quote",
    "title": "Lebbeus Woods Quote",
    "subtitle": null,
    "file_name": "lebbeus-woods-quote",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<p>Architecture is war. War is architecture. I am at war with my time, with history, with all authority that resides in fixed and frightened forms. I am one of millions who do not fit in, who have no home, no family, no doctrine, no firm place to call my own, no known beginning or end, no \"sacred and primordial site.\" I declare war on all icons and finalities, on all histories that would chain me with my own falseness, my own pitiful fears. I know only moments, and lifetimes that are as moments, and forms that appear with infinite strength, then \"melt into air.\" I am an architect, a constructor of worlds, a sensualist who worships the flesh, the melody, a silhouette against the darkening sky. I cannot know your name. Nor you can know mine. Tomorrow, we begin together the construction of a city.</p>\n<p>~ Lebbeus Woods</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:23.971Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b060",
    "layout": "quote",
    "title": "James P. Carse Quote",
    "subtitle": null,
    "file_name": "james-carse-quote",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<blockquote>\n  <p>\"Surprise in infinite play is the triumph of the future over the past. Since infinite players do not regard the past as having an outcome, they have no way of knowing what has been begun there. With each surprise, the past reveals a new beginning in itself. Inasmuch as the future is always surprising, the past is always changing… Because infinite players prepare themselves to be surprised by the future, they play in complete openness. It is not an openness as in candor, but an openness as in vulnerability. It is not a matter of exposing one’s unchanging identity, the true self that has always been, but a way of exposing one’s ceaseless growth, the dynamic self that has yet to be. The infinite player does not expect only to be amused by surprise, but to be transformed by it, for surprise does not alter some abstract past, but one’s own personal past.\"</p>\n</blockquote>\n<p>~ James Carse, Finite and Infinite Games</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:25.241Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b014",
    "layout": "page",
    "title": "Cultural Bias",
    "subtitle": "The impact of culture and geography on uncertainty.",
    "file_name": "cultural-bias",
    "parent_node": "the-beast",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Your understanding of uncertainty is determined in part by your profession, but also by your culture and geographic location. Dutch social psychologist Gerard Hofstede highlighted this fact through his framework for measuring cultural dimensions. He devised six dimensions by which cultures could be described. These are Power Distance, Individualism, Uncertainty avoidance, Masculinity, Long Term Orientation, and Indulgence vs. restraint. Uncertainty avoidance measures a culture's acceptance toward the ambiguous and unknown. Hofstede described cultures as located somewhere on the continuum between the two extremes described in the table below:[1]</p>\n<p>UNCERTAINTY AVOIDING | UNCERTAINTY TOLERANT\n---|---\nUncertainty is a threat | Uncertainty is normal\nFixed habits | Flexible habits\nDifferent is dangerous | Different is curious\nNeed for rules | Dislike for rules\nSeek truth | Seek understanding\nSlow adoption of the new | Rapid adoption of the new\nProne to stress | Less prone to stress</p>\n<p>You might recognize some of these traits in your culture or even yourself. For reference, the countries that score highest on uncertainty avoidance are Russia, Japan, Greece, and Portugal. The most uncertainty tolerant countries are Singapore, Hong Kong, and China in Asia, and Sweden, Denmark, Great Britain, and Ireland in Europe. Here is a world <a href=\"https://exhibition.geerthofstede.com/hofstedes-globe/\">map</a> if you want to explore more. The salient point is that we all carry a cultural bias in our attitude to uncertainty. This self-awareness is important when thinking and talking about this topic. </p>\n<hr>\n<p>[1] https://geerthofstede.com/culture-geert-hofstede-gert-jan-hofstede/6d-model-of-national-culture/</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:35.766Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b047",
    "layout": "page",
    "title": "Intelligence",
    "subtitle": "The combinatorial explosion of problem space.",
    "file_name": "intelligence",
    "parent_node": "evolution",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "evolution",
      "cognition"
    ],
    "content": "<p>Another concept that is embedded in the evolutionary root of uncertainty is <strong><em>intelligence</em></strong>. There are currently multiple, divergent definitions within cognitive science that refer to the ability to learn, to reason, and to adapt to new situations. Charles Spearman, an early 20th century psychologies argued that intelligence is a single, <strong><em>general cognitive ability</em></strong> (<a href=\"https://en.wikipedia.org/wiki/G_factor_(psychometrics)\">the g-factor</a>) that underlies all specific mental abilities. Psychologist Howard Gardner posited the theory of <strong><em>multiple intelligences</em></strong>: linguistic, logical-mathematical, spatial, bodily-kinesthetic, musical, interpersonal, and intrapersonal. Then there is the <strong><em>triarchic theory</em></strong> of intelligence proposed by psychologist Robert Sternberg, which posits that intelligence is composed of three components: analytical, creative, and practical.</p>\n<p>For the purpose of this book, I will use a broad definition of intelligence that goes beyond humans and highly evolved animals, to include all life forms and even machines. Going forward, I will equate intelligence with the process generally considered to be at its core: <strong><em>problem solving</em></strong>. Problem solving can be described as the process of identifying, analyzing, and resolving problems or obstacles to achieve a desired goal or outcome.</p>\n<p>How complex this process really is only became apparent when people attempted to replicate it in a machine. In 1959, Allen Newell and Herbert Simon developed a machine called the General Problem Solver. To do this, they formalized the concept of <strong><em>problem space</em></strong>, an abstract space containing an initial state, goal state, path constraints, and operators (rules) defining how to move within it. Their insights were tremendously important and continue to have applications in machine learning until today. However, as they honestly conceded, their method encountered major obstacles that apply not only to machines, but to all life forms trying to solve problems.</p>\n<p>First and foremost is <strong><em>combinatorial explosion</em></strong>. Whether digital or physical, large problem spaces with complex topologies of constraints and operators lead to a number of possibilities that exceed computational abilities. A simple chess game, for example, has an estimate of 10 to the power of 120 possible moves. This is known as the Shannon number and is larger than the total number of atoms in the universe. There are too many options to list, let alone compute. </p>\n<p>The second limitation are <strong><em>ill-defined problems</em></strong>. The concept of problem space assumes that goal state and constraints are known and well defined. However, due to the frequently poor quality of available information, this is rarely the case. “How to write a good essay?” My initial state is an empty page. My goal state a good essay. Where is the path to a solution? Frankly, I don’t know. I make it up as I go along. Ironically, the vast majority of situations we encounter are precisely of this kind.</p>\n<p>This is related to what philosopher David Chalmers calls the <strong><em>finitary predicament</em></strong>. According to Chalmers, the finitary predicament arises because our minds are finite and limited in their capacity to process information. We can only perceive a small fraction of the physical world, and we are limited in our ability to comprehend the complexity of the universe. As a result, our understanding of the world is necessarily incomplete and imperfect.</p>\n<p>These difficulties at problem solving are not limited to human consciousness. Microbes solve the problem of navigating chemical gradients, plants of timing their hibernation and blossoming, ants of communication through chemical signals. From this perspective, intelligence is inherent in all life, and applies (currently in the narrow sense) also to machines and algorithms. All organisms deal with a combinatorially explosive environment with limited cognitive and metabolic resources. This process is mediated by uncertainty because it is like navigating an ocean of the unknown. Within a vast problem space, a solution domain has to be formed. An area encompassing all that is available to action. This is the topic that will be explored in the branch on [agency]. For now I want to highlight that intelligence (problem solving) creates self-organizing boundaries that encompass the sum total of our action potential. I call this realm the <strong><em>possibility space</em></strong>.</p>\n<hr>\n<p>[1] Chalmers, D. J. (2003). Consciousness and its place in nature. In S. Stich &amp; T. Warfield (Eds.), Blackwell guide to philosophy of mind (pp. 102-142). Blackwell Publishing.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:14.850Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b048",
    "layout": "page",
    "title": "Irrelevance",
    "subtitle": "Two common mistakes we make when thinking about uncertainty.",
    "file_name": "irrelevance",
    "parent_node": "the-beast",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [],
    "content": "<p>Uncertainty is all around us. We are uncertain, to varying degrees, about that past, the present, and everything that lies in the future. However, it is neither a <em>thing</em>, nor the <em>property</em> of a thing. It is an abstract concept. This intangible nature makes it very hard for us to get an optimal grip on uncertainty. Due to this difficulty, we commonly make one of two mistakes:</p>\n<ol>\n<li>We <strong><em>substitute</em></strong> the ambiguous concept of uncertainty with another one that is more accessible and well defined, e.g. unknown, or unpredictable. This is the topic of the next section: [equivocation].</li>\n<li>We assume that uncertainty is <strong><em>irrelevant</em></strong>.</li>\n</ol>\n<p>Although we experience uncertainty every day, the idea is hard to grasp and define. It has no practical application in everyday life, and so it is easy to assume uncertainty is irrelevant to us. But nothing could be further from the truth. Although it is hard to describe, uncertainty affects us from the cellular level upward. It shapes our cognition, how we experience and perceive the world, how we behave and interact with others, how we build our identity, how we organize our knowledge and value system, and most importantly, how we perceive our self-efficacy. It has a powerful impact on our lives. It affects our decision-making and economic behavior. It is the seedbed of social trust and collaboration. It can send global markets into turmoil, disrupt national economies, and even trigger war. Whatever we think of uncertainty. Let us not be fooled into thinking it is irrelevant!</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:33.893Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b059",
    "layout": "page",
    "title": "Probability",
    "subtitle": "The limits of stochastic inference.",
    "file_name": "probability",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "probability",
      "epistemic"
    ],
    "content": "<blockquote>\n  <p>“<em>Probability is the most important concept in modern science, especially as nobody has the slightest notion what it means.</em>” - Bertrand Russel [1]</p>\n</blockquote>\n<p>The concept of probability is under-appreciated by most and truly understood by few. Probability theory is so crucial that in terms of importance, it rivals Einstein’s General Relativity and Newton’s Law of Motion.[2] As the basis for quantitative analysis of experimental data, it underpins modern empirical science as a whole. Especially in the field of computer science, probabilistic methods underlie a host of important functions. Machine learning, signal processing, image-, speech-, and text-recognition, as well as data compression all heavily rely on algorithms using statistical inference. That means that every time your mobile phone pings a cell tower, you make a purchase online, type a word into a search engine, or walk past a surveillance camera, your actions are analyzed by probabilistic means.</p>\n<p>Probability theory has found practical application in so many domains, that it is increasingly employed to make decisions in situations of uncertainty. This has led to the words <strong><em>probability</em></strong> and <strong><em>uncertainty</em></strong> to be used interchangeably, and to the false notion that uncertainty itself is a metric that can be captured, quantified, and resolved. This understanding is flawed, or at least only applies within a limited domain.</p>\n<p>In probability science, uncertainty is represented through probability distributions. A probability distribution is a function that assigns probabilities to all possible outcomes of an event, where the sum of all probabilities is equal to one. However, this requires some prior knowledge. To represent uncertainty using a <strong><em>normal distribution</em></strong>, one must know the mean, which is the average or central value of the distribution, and the standard deviation, which represents the spread or variability of the distribution. For a <strong><em>binomial distribution</em></strong>, one must know the number of trials (n) and the probability of success (p). For a <strong><em>Poisson distribution</em></strong>, only knowledge of the average rate of occurrence (λ) is needed. An <strong><em>exponential distribution</em></strong>, related to the Poisson, requires knowledge of rate parameter (λ). <strong><em>Bayesian</em></strong> statistical methods require the knowledge of not one, but two probability distributions (prior distribution and likelihood function) that are updated into a posterior function based on available evidence.</p>\n<p>Without getting too technical here, I think you can see my point. In order to represent uncertainty using probabilistic methods, we already need to know a great deal about what is going on. But this poses a dilemma. Uncertainty is about the <strong><em>unknown</em></strong>, yet these methods require considerable <strong><em>prior knowledge</em></strong> to have predictive power. How can we use probabilistic methods in situations of radical uncertainty, when this knowledge is not available?  The answer is we cannot. Probabilistic methods only apply when partial knowledge is available. To be fair, this is indeed frequently the case. We can apply stochastic inference when the probability distribution is known, or when ample historical data such as actuary tables or time series data is available. When enough data is available, it is also possible to use <strong><em>non-parametric</em></strong> [3] methods, a class of statistical techniques that do not require assumptions about the probability distribution of the data being analyzed. These methods can be useful when the data does not follow a specific probability distribution. However, they also require a critical mass of prior knowledge  and still make some assumptions about the data, such as independence, stationarity, and the bandwidth or kernel function used in estimation.</p>\n<p>But when so much is already known, are we still dealing with uncertainty? Arguably yes, but it is the <strong><em>resolvable</em></strong> kind. The lowercase 'u' uncertainty that can be overcome by applying existing models and available data. However, we must guard against using these models when distributions are unknown. Especially in high-stakes environments like environmental models, energy grid management, or modeling of financial markets, probabilistic models have diminished predictive power. In part, this is due to their <strong><em>non-stationary</em></strong> nature. In mathematics, the term \"non-stationary\" typically refers to a process that changes over time. More specifically, one in which the statistical properties of the process, such as the mean or variance, change over time. Although there are probabilistic methods to capture non-stationary processes [4], these have little predictive power when dealing with <strong><em>complex dynamical systems</em></strong>. These are systems with a large number of interacting components that exhibit complex and often unpredictable behavior that arises from the interactions between components. Complex dynamical systems are ubiquitous in nature and can be found in a wide range of fields, including physics, chemistry, biology, economics, and sociology. </p>\n<p>We will explore complex dynamical systems in depth in the branch on [knowledge], but for now we can summarize this page thus: all probabilistic methods of quantifying uncertainty require prior knowledge to have predictive power. This limits their domain of application to the situations where this knowledge is available. In situations of radical uncertainty, or when complex dynamical systems are involved. Probabilistic representations of uncertainty have little validity.</p>\n<p>Probability is <strong>not</strong> uncertainty.</p>\n<hr>\n<p>[1] Bertrand Russell, 1929 Lecture (cited in Bell 1945, 587.)</p>\n<p>[2] Lindley, D. (2013). Understanding Uncertainty (Revised ed.). Wiley.</p>\n<p>[3] Non-parametric methods: histograms, kernel density estimation, empirical distribution function, quantile-quantile plots. These methods have the advantage that they do not presuppose knowledge about probability distributions. However, they require large sample sizes to make meaningful statements.</p>\n<p>[4] Non-stationary processes can be modeled by autoregressive integrated moving average (ARIMA) or stochastic differential equations (SDEs). These methods require even more knowledge of the process being modeled, such as the autocorrelation, probability distributions, and the appropriate differential equations.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:18.737Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b006",
    "title": "Index First Principles",
    "file_name": "1-index first principles",
    "num_child_nodes": 0,
    "tags": [],
    "content": "<h1 id=\"firstprinciples\">First Principles</h1>\n<ul>\n<li><strong>The Beast</strong>: The relationship with negative spaces.<ul>\n<li><strong>Irrelevance</strong>: The two mistakes.</li>\n<li><strong>Epistemic Lenses</strong>: The fractured understanding of uncertainty. </li>\n<li><strong>Cultural Bias</strong>: The cultural dimension of uncertainty.</li>\n<li><strong>Aleatoric vs. Epistemic</strong>: Different kinds of uncertainty.</li>\n<li><strong>Boundaries</strong>: The boundaries around abstract ideas.</li></ul></li>\n<li><strong>Equivocation</strong>: Expressing different meanings.<ul>\n<li><strong>Ignorance</strong>: Absence of something. </li>\n<li><strong>FUD</strong>: Fear, uncertainty, and doubt.</li>\n<li><strong>Practical Certainty</strong>: Credence, belief, trust, and choice.</li>\n<li><strong>Risk</strong>:  Resolvable and radical uncertainty.</li>\n<li><strong>Probability</strong>: </li></ul></li>\n<li><strong>Dimensions of Uncertainty</strong>: Where it comes from.<ul>\n<li><strong>Evolution</strong>: Embodied knowledge<ul>\n<li><strong>Choice</strong>:  Perceive, decide, and act.</li>\n<li><strong>Intelligence</strong>: Combinatorial explosion.</li>\n<li><strong>Cognition</strong>: The fantastic organ.</li></ul></li>\n<li><strong>Metaphysics</strong>: First principles.<ul>\n<li><strong>Myth</strong>: Answers to metaphysical uncertainty.</li>\n<li><strong>Death</strong>: Eros and Thanatos.</li>\n<li><strong>Two worlds</strong>: Mind and matter.</li></ul></li>\n<li><strong>Society</strong>: Systematic arrangements of uncertainty.<ul>\n<li><strong>Relationship</strong>: Our relationship with uncertainty through the ages.</li>\n<li><strong>Control</strong>: Sovereignty, authority, and legitimacy.</li>\n<li><strong>Elmyra</strong>: Ritual of destruction.</li>\n<li><strong>Shoshana Zuboff Quote</strong> </li>\n<li><strong>Casting</strong>: Pre-dicting an uncertain future.</li>\n<li><strong>Causality</strong>: Post-diction as uncertainty reduction.</li>\n<li><strong>Competition</strong>: Manipulation of uncertainty.</li>\n<li><strong>Culture</strong>: Desired states of vulnerability.</li>\n<li><strong>Creativity</strong>: The endless creation of possibilities.</li>\n<li><strong>James Carse quote</strong> </li>\n<li><strong>Uncertainty Continuum</strong></li>\n<li><strong>Duality</strong> </li>\n<li><strong>Rot at the core</strong>: The meta-crisis of meaning.</li></ul></li>\n<li><strong>Spacetime</strong>: Dynamic entanglement with space and time.<ul>\n<li><strong>Space</strong>: Micro-localized perspective.</li>\n<li><strong>First-person-shooter</strong>: Spacio-temporal fragments of hyperobjects.</li>\n<li><strong>Layers</strong>: Metric and subjective space. </li>\n<li><strong>Past</strong>: Re-interpreting bygones.</li>\n<li><strong>Present</strong>: Clock time and lived time.</li>\n<li><strong>Future</strong>: The negative space of possibility.</li></ul></li></ul></li>\n<li><strong>Semantic mirror</strong>: A figure-ground reversal of perception.</li>\n</ul>",
    "child_nodes": [],
    "marginalia": []
  },
  {
    "_id": "64c88918a437e7743e95b013",
    "layout": "page",
    "title": "Creativity",
    "subtitle": "Infinite games - creating by way of objects.",
    "file_name": "creativity-6c",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>No domain actively utilizes uncertainty more than <strong><em>creativity</em></strong>. Although this is perhaps an obvious and somewhat intuitive claim, a lot of scholarship has explored this intricate connection. I have dedicated an entire branch of this book to this topic, which is close to my heart. Here, I just want to gesture at the following key points: </p>\n<p>Former head of the psychology department at the University of Chicago, Mihaly Csikszentmihalyi (pronounced six-cent-mihali) pointed out that uncertainty and ambiguity are inherent aspects of all creative work. Creative individuals often navigate complex and unpredictable problems, and they must be comfortable with taking risks and exploring new ideas. Csikszentmihalyi suggested that creative individuals often have a <strong><em>high tolerance for ambiguity</em></strong> and are able to embrace uncertainty as a necessary component of the creative process. In his view, creativity involves the concept of <strong><em>flow</em></strong>, a mental state of intense focus and enjoyment that people experience when they are fully engaged in an activity. [1]</p>\n<p>Carl Gustav Jung used the term <strong><em>daimon</em></strong> to describe an inner force or impulse that can drive individuals to pursue creative or destructive activities. Jung's concept of the daimon was part of his broader theory of the psyche, which emphasized the importance of exploring the unconscious mind. Jung believed that the daimon was an archetype, or a universal symbol, that represented the urge towards individuation, or the process of becoming one's true self. He argued that the daimon could manifest in a variety of ways, such as through creative impulses, spiritual experiences, or psychological disorders. Rollo May and Stephen A. Diamond's work on the daimonic builds on Jung's ideas, and they suggested that the daimonic is a natural and powerful force that is present in all individuals to some degree. They emphasized the importance of acknowledging and accepting the daimonic, and suggested that creative individuals in particular can use their creative abilities to explore and integrate this aspect of themselves in a healthy and constructive way. [2,3]</p>\n<p>One of my favorite frameworks to understand creativity is that of religious scholar and philosopher James P. Carse. For him, creativity was closely linked to the concept of <strong><em>play</em></strong>, which he saw as a fundamental human activity. He argued that play is a way of engaging with the world and with others in a way that is not goal-oriented or predetermined. He argued that creativity is an essential aspect of <strong><em>infinite games</em></strong>, which are games that are played for the sake of playing and that have no definite endpoint. According to Carse, finite games are those that are played to win or to achieve a specific goal, while infinite games are played for the joy of the game itself. Infinite games require creativity because they do not have a predetermined set of rules or boundaries. Players must be constantly adapting and evolving their strategies in order to keep the game going. He saw creativity as an infinite game and artists not as creators of objects, but as creators <strong><em>by way of objects</em></strong>. Carse understood creativity not as an action or thing, but as a continuity. The endless creation of possibilities. [4] </p>\n<p>We encounter creativity through creative people, their acts, and artifacts. Yet, creativity is neither a person, action, or thing. It is a <em>combinatorial force</em>. Creatives make possibilities through the defeat of habit by originality. To be an explorer and maker of possibilities you need to befriend uncertainty. You need a high tolerance for ambiguity, openness to new experiences, and to feel comfortable in the presence of paradox and complexity.</p>\n<hr>\n<p>[1] Csikszentmihalyi, Mihaly (1996). Creativity: Flow and the Psychology of Discovery and Invention. New York: Harper Perennial.\n[2] Jung, C. G. (1991).&nbsp;<em>The archetypes and the collective unconscious</em>&nbsp;(R. F. C. Hull, Trans.; 2nd ed.). Routledge.\n[3] Anger, Madness, and the Daimonic: The Psychological Genesis of Violence, Evil, and Creativity (1996), SUNY Press\n[4] Carse, J. P. (1987).&nbsp;<em>Finite and infinite games</em>. Penguin Books.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:30.907Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00b",
    "layout": "page",
    "title": "Boundaries",
    "subtitle": "Semantic boundaries of abstract ideas.",
    "file_name": "boundaries",
    "parent_node": "the-beast",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "semiotic"
    ],
    "content": "<p>We underestimate the vast reach of uncertainty into every aspect of life. This is reflected in our language. For this reason, the word \"uncertain\" has a problem of <strong><em>boundaries</em></strong>. By that I mean that it is closely associated with adjacent concepts that mask its true meaning. This is not uncommon. The English word \"love\" also strains against semiotic boundaries. It describes a coterie of entirely different emotions: those between a mother and her child, passionate lovers, soldiers in military units, or couples after decades of partnership. Similarly, language struggles to properly capture the meaning of \"uncertainty\". To untangle this knot, we need to perform some semiotic surgery. We need to re-draw the boundary of meaning around the word \"uncertain\". </p>\n<p>This is useful because words attempt to capture abstract ideas. For example, the word \"bird\" captures the idea of a <strong><em>type</em></strong> of creature. An idea does three things: First, it <strong><em>includes</em></strong> a set of properties (e.g. beak, feathers, and wings). Second, it arranges those features in a particular <strong><em>order</em></strong> (e.g. in the structural, functional shape of a bird). Third, it <strong><em>excludes</em></strong> all other properties (such as color, texture, size, or location of individual birds). Crucially, ideas are defined by the features they <strong><em>contain</em></strong>, as well as <strong><em>omit</em></strong>. In other words, to understand an idea such as uncertainty, we need to pay special attention to its <strong><em>boundaries</em></strong>. A good place to start are synonyms used interchangeably with uncertainty. Here are some I found in various dictionaries:</p>\n<blockquote>\n  <p>Indeterminate, dubious, unknown, vague, ambiguous, indefinite, obscure, unpredictable, capricious, changeable, fickle, fluctuating, fluid, inconsistent, mercurial, skittish, temperamental, unsettled, unstable, unsteady, variable, volatile.</p>\n</blockquote>\n<p>The above word-soup appears random, but it contains an interesting pattern. The first seven terms are concerned with quality of information. They describe something missing. A lack of clarity or trust in <strong><em>knowledge</em></strong>. The eighth word, \"unpredictable\", is a statement about our (in)ability to make <strong><em>forecasts</em></strong>. And all remaining terms are just variations on the same theme: <strong><em>dynamic change</em></strong>. And herein lies the first clue: These words are <strong><em>not</em></strong> <strong><em>synonyms</em></strong> at all. They do not describe uncertainty itself, but qualify our fickle relationship with <strong><em>knowledge</em></strong>, <strong><em>prediction</em></strong>, and <strong><em>change</em></strong>. Specifically, they speak of our failures in this regard. Our flawed pursuit of knowledge, faulty predictions, and struggles in coping with change. </p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:36.621Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00f",
    "layout": "page",
    "title": "Causality",
    "subtitle": "Post-diction, or tracing events back in time.",
    "file_name": "causality",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Understanding causality is not concerned with pre-diction, but with <strong><em>post-diction</em></strong>. Starting from a present situation, an attempt is made to trace a causal chain of events backwards in time. This establishes a narrative for the purpose of attributing either <strong><em>merit</em></strong> or <strong><em>blame</em></strong>. History is such an attempt to attribute merit, largely for the purpose of identity projection. The goals, motivations, and conflicts of historical figures are connected to the unfolding of past events in a unified grand narrative that gives meaning to the present. Of course, any post-diction is fraught with uncertainty. Not only do we only have partial knowledge of past events, but we can only speculate as to the motivations and inner motives of persons long since deceased. As this combines partial knowledge, interpretations, and inherent biases of the post-dictor, this practice is of a highly speculative nature.</p>\n<p>The practice of post-diction for the purpose of attributing blame is called the law. This is usually done in a three-step process. First, during the fact-finding process, the chain of events is identified that led to a disputed outcome. Second, it must be determined which laws apply to this situation. Third, a judge applies those laws and pronounces a ruling. Although great care is taken to avoid mistakes, <strong><em>factual uncertainty</em></strong> about the circumstances, events, and the evidence can never be entirely eliminated. Also, <strong><em>rule uncertainty</em></strong>, the ambiguity about which laws to apply is ever present. Habeas Corpus and the burden of evidence are two methods employed to protect defendants against some of the uncertainty involved. </p>\n<p>Bottom line, all post-diction activity is an attempt to reduce or eliminate uncertainty as much as possible. </p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:29.625Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b008",
    "layout": "quote",
    "title": "DeNicola Quote",
    "subtitle": null,
    "file_name": "denicola-quote",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "epistemic"
    ],
    "content": "<blockquote>\n  <p>“Our learning responds to (some) ignorance, eliminates (some) ignorance, manages (some) ignorance, creates a refined and restructured ignorance, and grows knowledge within that vast surround. We grasp the epistemic aspects of the human condition only when we understand the interaction between our knowing and the unknown.”</p>\n</blockquote>\n<p>~ Denicola,&nbsp;D.&nbsp;R.&nbsp;(2017).&nbsp;Understanding Ignorance: The Surprising Impact of What We Don't Know.&nbsp;United States:&nbsp;MIT Press.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:16.579Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00a",
    "layout": "page",
    "title": "Rot at the Core",
    "subtitle": "A prayer for the future.",
    "file_name": "rot-at-the-core",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>All is not well in paradise. In the wealthiest pockets of global societies - paradigms of profit and prosperity - there is rot at the core. Many are afflicted with feelings of general <em>malaise</em>, or a deep weariness that things are getting worse. Cases of depression and suicide are on the rise, and so are instances of Generalized Anxiety Disorder. Substance addiction is steadily increasing. Loneliness afflicts legions of city dwellers, driving a virtual exodus into rural utopias or a digital meta-verse. The ghost of uncertainty is haunting the mansion of human civilization. This meta-crisis is fundamentally a crisis of <strong><em>meaning</em></strong>. The social complexity of civilization has increased to the point where we barely have the energy to sustain it. Group consensus and problem-solving mechanisms are breaking down. The social norms used to conjure illusions of certainty are crumbling under the hammer blows of rapid change. The world views, values, and consensus mechanisms underlying functioning society are disintegrating. </p>\n<p>The point is this: we live in a radically different world now, compared to when the norms and institutions of current society were created. Since November 16th 2022, there are over 8 billion people inhabiting this planet, sharing information with one another at the speed of light. Consuming resources at a rate 1.7X faster than the biosphere can regenerate, while operating an economic framework optimized for exponential growth. This system is enabled by vast amounts of energy produced from hydrocarbons burned at an increasing cost in, both, dollar value and catastrophic climate impact. This radically different world requires radically different sets of social technology. <strong><em>We need an updated world view.</em></strong> One in which finite resources are not a free-for-all banquet in a planetary-scale tragedy of the commons. One in which the economy is subordinate to ecology, not the other way around. One in which social technology actively enables long-term positive-sum dynamics and collective problem-solving mechanisms. To make meaningful progress in that direction, we cannot cling to centuries-old norms promoting <strong><em>illusions of certainty.</em></strong> We must renounce our addiction to frozen forms and face our fear of the unknown. Instead of reducing uncertainty we must domesticate it. Perhaps we are still in time to learn to harness the creative power awarded to us. </p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:33.185Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b061",
    "layout": "page",
    "title": "Risk",
    "subtitle": "Resolvable versus radical uncertainty.",
    "file_name": "risk",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "probability",
      "economics"
    ],
    "content": "<p>At this point, you might retort that, philosophy and linguistics aside, there are entire branches of science examining uncertainty with objective, empirical methods. You might argue that uncertainty is a quantifiable metric that can be represented through <strong><em>probabilistic</em></strong> means. And you would be correct. In probability science, uncertainty is represented through probability distributions, which provide a way to quantify and model the likelihood of different outcomes. The fields of thermodynamics, quantum physics, information theory, and artificial intelligence would be unthinkable without the use of probabilistic methods. Applied probability theory has shown to have great predictive power and underlies many advanced technologies we take for granted. Surely, these stochastic models can quantify and represent uncertainty, right?</p>\n<p>Although it is useful to associate the concepts of uncertainty and probability, we should not confuse the two, for they are two distinct ideas. I will use an example from the field of economics to illustrate this. According to modern economic theory, rational agents make decisions based on projections of anticipated value. This value can be captured by a <strong><em>utility function</em></strong> that represents an agent's preferences among a set of choices. This is usually calculated by multiplying the weighted sum of utility values with their respective probabilities. This method makes a host of assumptions. For one, it assumes that the agent making the decision is rational - a claim challenged by any number of passing observations of human behavior. It also assumes that agents accurately map their values, available choices, and expectations of future reward - an idea increasingly challenged by cognitive science. Most importantly, the method also assumes the knowledge of probabilities for each possible outcome. This last assumption highlights an intrinsic limitation of the principle underlying all of probability: It is a method that substitutes the lack of <strong><em>specific knowledge of an instance</em></strong> with <strong><em>general knowledge of the whole</em></strong>.</p>\n<p>Probabilistic methods infer information about each instance through knowledge about the stochastic distribution of the whole set. That is tremendously useful, but this tool is limited to the domains in which these stochastic distributions are <strong><em>known</em></strong>. Unsurprisingly, this is not always the case. Oftentimes, when building predictive models, the creators simply assume a distribution such as the normal or log-normal distribution. However, this small shortcut conceals a critical failure. It is the failure to make a distinction that used to be well known in economics. Towering figures such as John Maynard Keynes and Frank Knight used to make a distinction between <strong><em>uncertainty</em></strong> and <strong><em>risk</em></strong>. Economists Mervyn King and John Kay clearly point out this distinction: </p>\n<blockquote>\n  <p>“We have chosen to replace the distinction between risk and uncertainty deployed by Knight and Keynes with a distinction between <strong>resolvable</strong> and <strong>radical</strong> uncertainty. Resolvable uncertainty is uncertainty which can be removed by looking something up (I am uncertain which city is the capital of Pennsylvania) or which can be represented by a known probability distribution of outcomes (the spin of a roulette wheel). With radical uncertainty, however, there is no similar means of resolving the uncertainty – we simply do not know. (…) Radical uncertainty cannot be described in the probabilistic terms applicable to a game of chance. It is not just that we do not know what will happen. We often do not even know the kinds of things that might happen.”[1] </p>\n</blockquote>\n<p>Risk is <strong><em>resolvable uncertainty</em></strong> that can be eliminated using prior knowledge, such as probability distributions, time series data, actuary tables, or algorithms capturing human behavioral patterns. This method is useful, but like all tools it has limited domain validity. Representing uncertainty probabilistically is useful when there is enough prior knowledge about the process being modeled. <strong><em>Radical uncertainty</em></strong> cannot be captured that way, because it deals with the <strong><em>unknown unknown</em></strong>. Intellectual honesty demands that we acknowledge these limitations and abstain from cloaking radical uncertainty in probabilities.</p>\n<p>Risk is <strong><em>not</em></strong> uncertainty.</p>\n<hr>\n<p>[1] King, Mervyn A, and J A Kay. Radical Uncertainty : Decision-Making for an Unknowable Future. London, The Bridge Street Press, 2020.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:18.314Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b07c",
    "layout": "quote",
    "title": "Terence Deacon Quote",
    "subtitle": null,
    "file_name": "terence-deacon-quote",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<blockquote>\n  <p>You are reading these words because of something that they and you are not: the ideas they convey. Whatever else we can say about these ideas, it is clear that they are not the stuff that you and this book are made of. The problem is this: Such concepts as information, function, purpose, meaning, intention, significance, consciousness, and value are intrinsically defined by their fundamental incompleteness. They exist only in relation to something that they are not.</p>\n</blockquote>\n<hr>\n<p>~ Terence Deacon (2011).&nbsp;Incomplete Nature: How Mind Emerged from Matter</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:26.974Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b09a",
    "layout": "section-head",
    "title": "The Beast",
    "subtitle": "Something is missing.",
    "file_name": "the-beast",
    "parent_node": "first-principles",
    "num_child_nodes": 5,
    "visibility": true,
    "tags": [
      "section-head",
      "meta"
    ],
    "content": "<p>Thinking about uncertainty is hard, and as I found out, writing about it even harder. However, it is not immediately apparent why. \"Uncertain\" is a common word, indicating something only partially known or not entirely predictable. This may appear simple, but as you are about to find out, it is anything but. I have come to think of uncertainty as a profoundly misunderstood concept. At the core, this is due to its <strong><em>absential</em></strong> nature. I borrow this term from Terence Deacon, who used it to describe phenomena defined by their causal relationship with something missing or absent.[1]</p>\n<p>I submit that uncertainty is far more significant than is commonly thought, but because of its absential nature, its true importance has mostly eluded us. Like \"truth\", \"reality\", and \"information\", uncertainty is an abstract concept that is intimately entwined with lived experience, yet it has not received the attention and scrutiny of the former. This book is an attempt to redress this asymmetry. It is the exploration of the nature of uncertainty in general, and its relevance in our knowledge, agency, creativity, and meaning-making in particular.</p>\n<p>Don't be fooled by its hazy appearance. Uncertainty is a formidable beast!</p>\n<hr>\n<p>[1] Deacon, T. W. (2011).&nbsp;<em>Incomplete Nature: How Mind Emerged from Matter</em>&nbsp;[Kindle Android version]. Retrieved from <a href=\"http://Amazon.com\">Amazon.com</a> </p>\n<hr>\n<h3 id=\"thebeastthebeast\">[[The-beast| The Beast]]</h3>\n<blockquote>\n  <p>[[irrelevance|Irrelevance]] - <em>The two mistakes.</em>\n  [[epistemic-lenses|Epistemic Lenses]] - <em>The fractured understanding of uncertainty.</em>\n  [[cultural-bias|Cultural Bias]] - <em>The cultural dimension of uncertainty.</em> \n  [[aleatoric-epistemic|Aleatoric vs. Epistemic]] - <em>Different kinds of uncertainty.</em> \n  [[boundaries|Boundaries]] - <em>The boundaries around abstract ideas.</em> </p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "irrelevance",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b09b"
      },
      {
        "name": "epistemic-lenses",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b09d"
      },
      {
        "name": "cultural-bias",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b09f"
      },
      {
        "name": "aleatoric-epistemic",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b0a1"
      },
      {
        "name": "boundaries",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b0a3"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:48:11.092Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b02d",
    "layout": "page",
    "title": "First-Person Shooter",
    "subtitle": "The uncertainty of hyperobjects.",
    "file_name": "first-person-shooter",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>Our perspective on the world is point-focused. Micro-localized. We are the <strong><em>first-person shooter</em></strong> in our own video game. A protagonist running through endless corridors, always blatantly unaware of what lies behind the pixelated wall. Ignorant of the dangers lurking around the next corner. This perspective creates a concentric tunnel-vision making the world appear anthropocentrically scaled. It creates the illusion that anything close to us is more salient. That things in the distance are less important. The existential challenge we face today, the end-level-boss if you will, is neither local nor human-scaled. It is a <strong><em>hyperobject</em></strong>. This term was created by Timothy Morton to describe things like evolution, extinction, climate change, or plastic waste.[1] Things so distributed across time and space, that we cannot directly experience them. At best, we can perceive spacio-temporal fragments of them. Micro-manifestations of something much, much bigger. We don’t experience the global climate. We perceive rain, wind, heat, sunshine, a thunderstorm, or a forest fire destroying our home. Hyperobjects cannot be neatly shrink-wrapped, labeled, and categorized. Our micro-perspective fails to comprehend their transfinite nature. To make sense of them we must move from an egocentric to an allocentric world view. A view in which we capture our relationship with a larger whole. Or as John Vervaeke more poetically put it, we must reach a state in which “<em>the salience of reality is finally capable of eclipsing the narcissistic glow of our ego.</em>”[2]</p>\n<hr>\n<p>[1] Morton, T. (2013). Hyperobjects: Philosophy and ecology after the end of the world. University of Minnesota Press.\n[2] Awakening from the Meaning Crisis, EP. 11, 19:45 min\nhttps://www.youtube.com/watch?v=39NpjQDtqNw&amp;feature=emb<em>imp</em>woyt</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:23.105Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b017",
    "layout": "quote",
    "title": "Dennis Lindley Quote",
    "subtitle": null,
    "file_name": "dennis-lindley-quote",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<blockquote>\n  <p>You are uncertain, to varying degrees, about everything in the future; much of the past is hidden from you; and there is a lot of the present about which you do not have full information. Uncertainty is everywhere and you cannot escape from it.</p>\n</blockquote>\n<hr>\n<p>~ Dennis Lindley, (2006).&nbsp;Understanding Uncertainty</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:24.401Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b021",
    "layout": "image",
    "title": "Duality",
    "subtitle": "The dichotomy of uncertainty across domains.",
    "file_name": "duality",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social",
      "diagram"
    ],
    "content": "<p>![[Uncertainty session Jan 2023.001.png]]</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:32.363Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b024",
    "layout": "section-head",
    "title": "Evolution",
    "subtitle": "Evolution as embedding of knowledge about the environment.",
    "file_name": "evolution",
    "parent_node": "dimensions-of-uncertainty",
    "num_child_nodes": 4,
    "visibility": true,
    "tags": [
      "evolution",
      "section-head"
    ],
    "content": "<p>Uncertainty has an evolutionary root. That is because all life partakes in a continuous dance. A feedback loop between organism and environment. Through recursive interaction, life and its surroundings modify and <strong><em>encode each other.</em></strong> By encoding I mean organisms embodying features of their environment and the environment being shaped by features of organic life. On one side, the environment gradually forms the body shape, behavior, and sensory-motor patterns of the organism through evolution. On the other side, the feeding, breathing, excreting, reproduction, and niche-creation gradually forms the environment. The environment and the organism shape and encode each other in a continuous loop. </p>\n<p>On the side of the organism, this process takes place through the 3-step mechanism of natural selection: </p>\n<ol>\n<li>diverging features in members of a population (mutation)</li>\n<li>differential rates of replication (reproductive advantage)</li>\n<li>diffusion of naturally selected features (heritability)</li>\n</ol>\n<p>From this evolutionary perspective, each phenotype[1] represents <strong><em>embodied knowledge</em></strong> about its environment. Even the niches shaped by life in the environment could be said to represent a kind of <em>knowledge</em>. Knowledge about the inhabitants. Our common understanding that uncertainty is related to knowledge is, of course, correct. However, this connection goes far beyond the narrow definition of knowledge as propositions or facts held within the human mind. As we will see in the branch about [knowledge], the full scope of uncertainty can only be understood through the frame of embodied knowledge, defined as <strong><em>agents shaped by evolution to integrate information about their environment.</em></strong></p>\n<p>But before we delve into the domain of knowledge, we must acknowledge the role of evolution as a whole. Each living organism is an embodied bet on differential chances of survival. A bet on the optimal fitted-ness between it and the inhabited arena. For all life, this is a bet most uncertain.</p>\n<hr>\n<p>[1] <strong><em>Phenotype</em></strong>: In genetics, the <strong>phenotype</strong> is the set of observable characteristics or traits of an organism. The term covers the organism's morphology (physical form and structure), its developmental processes, its biochemical and physiological properties, its behavior, and the products of behavior. This is distinct from the genotype, an organism's genetic material.</p>\n<blockquote>\n  <p><a href=\"https://en.wikipedia.org/wiki/Phenotype\">Wikipedia</a>: </p>\n</blockquote>\n<hr>\n<h3 id=\"evolutionevolution\">[[evolution|Evolution]]</h3>\n<blockquote>\n  <p>[[choice|Choice]] - <em>Perceive, decide, act.</em>\n  [[mollys-song|Molly's Song]]\n  [[intelligence|Intelligence]] - <em>Combinatorial explosion</em>\n  [[cognition|Cognition]] - <em>The fantastic organ.</em>\n  [[creation-and-destruction|Creation and Destruction]] ==WRITE==</p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "choice",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b025"
      },
      {
        "name": "mollys-song",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b027"
      },
      {
        "name": "intelligence",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b029"
      },
      {
        "name": "cognition",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b02b"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:38.845Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05c",
    "layout": "quote",
    "title": "Reflection at Sea",
    "subtitle": null,
    "file_name": "reflection-at-sea",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<blockquote>\n  <p>See how beneathe the moonbeams smile\n  Yon little billow heaves its breast\n  And foams and sparkles for a while\n  And murmuring then subsides to rest,\n  Thus man, the sport of bliss and care,\n  Rises on times' eventful sea,\n  And having spent a moment there,\n  Thus melts into eternity !</p>\n</blockquote>\n<p>~ Thomas Moore, A Reflection at Sea, The Poetical Works of Thomas Moore (1841)</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:26.116Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00c",
    "layout": "page",
    "title": "Aleatoric vs. Epistemic",
    "subtitle": "Two types of uncertainty.",
    "file_name": "aleatoric-epistemic",
    "parent_node": "the-beast",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "epistemic"
    ],
    "content": "<p>There is an important distinction between types of uncertainty that originated in the medical field and is now widely applied in data science and deep learning. This is the distinction between <strong><em>aleatoric</em></strong> and <strong><em>epistemic</em></strong> uncertainty. </p>\n<p><strong><em>Aleatoric</em></strong> uncertainty (from Latin: <em>alea</em> for dice) is due to inherent randomness of a process. This can be noise in data, minute friction effects, or fluid dynamics that affect a result. For example, complex systems like the weather are so sensitive to their constraints and surrounding conditions that minute changes on the micro-scale can have macro-level effects (the famous butterfly effect). This aleatory uncertainty is <strong><em>irreducible in practice</em></strong> due to physical limitations in the precision of measuring equipment. However, it is also <strong><em>irreducible in principle</em></strong>, no matter how much knowledge or compute power is available. This was beautifully illustrated by Michael Berry in his 1978 paper \"Regular and Irregular motion\". Berry calculated that even something as simple as the movement of billiard balls would be impossible to calculate (meaning it is indeterminate) after the 8th collision due to the perturbing gravitational effect of the billiard player. The movement of an oxygen atom would become indeterminate after the 55th collision due to the gravitation effect of a single electron at the edge of the observable universe. [1]  </p>\n<p><strong><em>Epistemic</em></strong> uncertainty (from Greek: episteme for knowledge) on the other hand, is due to a lack of knowledge. This is the kind of uncertainty that can be mitigated by acquiring more information about the issue at hand. For example, uncertainty about a disease outbreak can be addressed by broad-scale testing of the affected population and epidemic analysis. Aleatoric and epistemic uncertainty are frequently combined in the same situation. In the example of a health issue, the epistemic uncertainty must be addressed by testing and diagnosis, whereas a certain amount of aleatoric uncertainty always remains due to imperfect testing equipment (e.g. false positives) and the possibility of a wrong diagnosis.</p>\n<p>This distinction highlights the fact there are different <strong><em>kinds</em></strong> of uncertainty that are fundamentally different in nature. This is important. In the branch about [knowledge] we will discover that there are at least 8 different kinds of uncertainty, but let's not get ahead of ourselves. First we must disentangle the confusion and misunderstandings the term \"uncertain\" is currently saddled with.</p>\n<hr>\n<p>[1] MacKay, R.S., &amp; Meiss, J.D. (Eds.). (1987). Hamiltonian Dynamical Systems: A REPRINT SELECTION (1st ed.). CRC Press. https://doi.org/10.1201/9781003069515</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:36.180Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b00d",
    "layout": "page",
    "title": "Choice",
    "subtitle": "Making predictions.",
    "file_name": "choice",
    "parent_node": "evolution",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "evolution"
    ],
    "content": "<p>Choice is an integral part of life. Broadly speaking, <strong><em>\"choice\"</em></strong> can be defined as <em>performing an action path over possible others</em>. From this perspective, choosing is by no means exclusive to humans. Insects choose what is safe to eat, plants when to blossom, and bacteria where to swim to find nutrients (chemotaxis). Conceptually, choices are made using a PDA loop, short for <em>perceive</em>, <em>decide</em>, and <em>act</em>. A mechanism that does not necessarily require a brain - just the sensing of the environment, comparing it with stored if-then patterns, and triggering action. </p>\n<p>Of course, an E-Coli bacterium uses different machinery than an animal with a complex nervous system to make decisions. However, fundamentally they both encode causal patterns \"learned\" over evolutionary time spans for the purpose of evolutionary fitness. We usually call these patterns by a different name: <strong><em>inferences</em></strong>. These inferences are used as raw material for manufacturing <strong><em>predictions</em></strong> - a commodity that most organisms rely on for survival. We will explore the concept of choice in great detail in the branch about [agency]. </p>\n<p>For now the salient point is this: Choice is another evolutionary root of uncertainty. This is because the machinery of choice is based on making predictions. And predictions can be, and often are, wrong. In the arena of evolution, this can make the difference between life and death. When making decisions, whether you are a CEO or a dung beetle, uncertainty abounds.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:13.784Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b04b",
    "layout": "quote",
    "title": "Jung Quote",
    "subtitle": null,
    "file_name": "jung-quote-red-book",
    "parent_node": "metaphysics",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<blockquote>\n  <p>“From afar shines your own height in golden light across the sea. Like the moon arising from the tides. And you become aware of yourself from afar. And the longing grips you and the will to move yourself. You want to go from Being to Becoming because you understood the breathing and flowing of the sea - leading you here and there without attaching you anywhere. And your wave flings you onto foreign shores - swallows you up and gurgles you down. You saw that it was the life of the whole and the death of each one. Then you felt embraced by general death, by death in the deepest place on earth. Of death in your own strangely breathing and flowing depths. Oh how you long and despair, mortal fear grips you in all this death - breathing slow, eternal flow of coming and going. All these light and dark, warm and tepid and cold waters. All those wavy, swaying, swinging plant-animals and animal-plants. All these nocturnal wonders fill you with dread and you long for the sun, for clear, dry air, for solid stone, for defined space and straight line, for the unmoved and held fast, for rules and a stated purpose, for being alone and your own intention.” </p>\n</blockquote>\n<p>~ Carl Gustav Jung, The Red Book</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:21.836Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b099",
    "layout": "page",
    "title": "Two Worlds",
    "subtitle": "The magic trick of two-world mythologies.",
    "file_name": "two-worlds",
    "parent_node": "metaphysics",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "metaphysics"
    ],
    "content": "<p>In order to address our metaphysical uncertainty, all mythologies perform a magic trick. They conjure up another plane of existence, a separate realm veiled from our perception. In other words, all mythologies are <strong><em>two-world mythologies</em></strong>. They contain a physical domain we can perceive and a spirit realm beyond our senses. This is sometimes overt, as in the idea of the Heavens populated with spirits, angels, and gods, and sometimes more covert, as in the idea of an immortal soul, or spark of life. The two-world structure of mythology is so embedded in our worldview that it often goes unnoticed. Despite some progress in an intellectual debate that has lasted centuries, the idea that mind and matter are distinct substrates has stubbornly persisted among philosophers and scientists until today. </p>\n<p>Because the idea of the immortal soul has historically been violently exploited to compel, coerce, and conquer, I used to insist on holding religious authority to account for this cruel injustice. Today, I have a more nuanced view about the severance of the mythological planes. Paradoxically, the invention of an abstract, artificial world beyond ours serves the purpose of producing certainty in an uncertain world. Religious practices worldwide serve the crucial function of resolving metaphysical uncertainty. They create meaning by connecting the individual with the cosmos, society, and him- or herself. This triple bond forms the basis of our relationship with the world. It <strong><em>grounds</em></strong> us in the arena of reality. Without it we feel lost. </p>\n<p>Much of the malaise in modern societies is due to the lack of this grounding. Perhaps it is time for us to re-connect (re-ligio) with the world through a new mythos. However, this cannot be done by re-enacting mistakes from the past. Intellectual honesty demands that this new mythos be constructed from a <strong><em>one-world mythology</em></strong> openly created to address our metaphysical uncertainty without recourse to gods as purveyors of a blissful afterlife. Perhaps we can see the world through a mythological hero's journey, sailing the seas of uncertainty into humanity's distant future.[1]</p>\n<hr>\n<p>[1] John Vervaeke: Awakening from the Meaning Crisis. https://www.youtube.com/playlist?list=PLND1JCRq8Vuh3f0P5qjrSdb5eC1ZfZwWJ</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:22.257Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b015",
    "layout": "page",
    "title": "Culture",
    "subtitle": "Systematic arrangements of uncertainty.",
    "file_name": "culture",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Cultural identity is formed by a multitude of social norms, codifying everything from religious beliefs, customs, etiquette, culinary traditions, architecture, and the arts. It would appear that these <strong><em>explicit</em></strong> rules make up the fabric of society. However, it is the <strong><em>tacit</em></strong> rules that define many cultural traits. These are the <em>unknown knowns</em>, or amnesic spaces into which our speech and thought must not stray. Therefore, culture is to some extent the <strong><em>systematic arrangement of uncertainty</em></strong>.</p>\n<p>Social trust is a good example. It makes the relations possible that hold together large cohorts of strangers in a society. But social trust cannot be established by explicit rules, because it requires a <strong><em>desired state of vulnerability</em></strong>. For one party to trust another, the trusting must remain partially uncertain about the entrusted. If one side insists on removing this uncertainty, say, by asking too many questions, the other side will infer that trust has been lost.&nbsp;The glue holding society together requires this active manipulation of uncertainty.</p>\n<p>Etiquette is another example: the rules that codify behavior in polite society describe how to behave in specific situations just as much as how <strong><em>not</em></strong> to behave. Of course, these tacit rules are locally encoded and vary greatly between cultures. I have frequently been asked how much money I make in Shanghai taxis, but never in central London ones. The same goes for social taboos. Every culture has strict rules for the treatment of the deceased, sexual obscenity, murder, and incest. Strict dietary rules govern what is acceptable to eat. No cows in India, no pigs in the Middle East, no pets or cannibalism (almost) anywhere. </p>\n<p>In the framework developed by Mary Douglas, social norms are described as symbolic order, established by creating epistemic boundaries. These norms systematically arrange and categorize objects, people, and practices. Everything and everyone located outside of these boundaries is impure, dangerous, and a threat to social stability. This active manipulation of uncertainty is how society creates its values and cultural meaning. [1]</p>\n<hr>\n<p>[1] Douglas, Mary. Purity and Danger: An Analysis of the Concepts of Pollution and Taboo. Routledge, 2002.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:30.482Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b009",
    "layout": "page",
    "title": "FUD",
    "subtitle": "Fear, uncertainty, and doubt.",
    "file_name": "FUD",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "exploration",
      "exploitation"
    ],
    "content": "<p>Most of us meticulously avoid uncertainty because we instinctively associate it with <strong><em>doubt</em></strong>, <strong><em>insecurity</em></strong>, and <strong><em>fear</em></strong>. This is of practical importance, because our decision-making under uncertainty is heavily skewed by this emotional coupling. We can see this clearly in our attitude to risk. Most of us tolerate risk in situations in which we stand to <strong><em>gain</em></strong> or see opportunity. However, we become risk averse when we focus on potential <strong><em>loss</em></strong>. This fundamental duality is found in all life. Due to the constant need for nutrition and evolutionary fitness points, life sometimes operates in <strong><em>exploration</em></strong> mode: an active search for new opportunities and reward with a <strong><em>high tolerance for risk</em></strong>. However, once an opportunity is seized or a reward acquired, life switches to <strong><em>exploitation</em></strong> mode: an efficiency-focused use of resources in which risk and uncertainty are <strong><em>avoided</em></strong> at all cost. In which of these modes we operate largely determines our behavior.[1]</p>\n<p>However, this adversarial system of exploration / exploitation is easily hacked and manipulated. Lotteries turn a profit because they call attention to potential gain (exploration), and insurance companies make a good buck because they highlight potential losses (exploitation). Other methods, like FUD, are more deleterious. FUD stands for fear, uncertainty, and doubt, a highly efficient propaganda technique employed in sales, marketing, and public relations. It consists in the spread of disinformation that appeals to fear, triggering the risk and loss aversion typical of the exploitation mode. In this state, an audience is more likely to chose the safer option at hand, usually a political incumbent or an established legacy product.[2]</p>\n<p>We associate fear, insecurity, and doubt with uncertainty, because they are causally linked. But although they are related, they are also distinct from one another. Uncertainty is what <strong><em>causes</em></strong> these emotions. It is the trigger for a complex battery of electro-chemical signals produced by the amygdala in our brain. It is how evolution has conditioned us to respond to uncertainty, but these emotions are <strong><em>not</em></strong> uncertainty itself. </p>\n<hr>\n<p>[1] Preuschoff K, Mohr PNC and Hsu M (2013) Decision making under\nuncertainty. Front. Neurosci.7:218. doi: 10.3389/fnins.2013.00218\n[2] Raymond, Eric Steven, ed. (2003-12-29).&nbsp;<a href=\"http://www.catb.org/~esr/jargon/html/F/FUD.html\">\"FUD\"</a>.&nbsp;<em><a href=\"https://en.wikipedia.org/wiki/The_Jargon_File\" title=\"The Jargon File\">The Jargon File</a></em>. Version 4.4.7</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:17.001Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05f",
    "layout": "page",
    "title": "Semantic Mirror",
    "subtitle": "A figure-ground reversal of perception.",
    "file_name": "semantic-mirror",
    "parent_node": "first-principles",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "semiotic"
    ],
    "content": "<p>So here is the claim I will develop throughout the book: Uncertainty is what philosophers might call an ontological primitive - a fundamental building block of reality. As I have mentioned earlier, I submit that uncertainty is the <strong><em>relationship with a negative space</em></strong>. Because this statement by itself raises more questions than it answers, I promise to spend the rest of this book clarifying them as best I can. However, for now please note that, if true, it has some astonishing consequences. This interaction with a negative space creates a <strong><em>semantic mirror effect</em></strong> of sorts. A figure-ground reversal that makes us see uncertainty as the opposite of what it really is. For example, we commonly think of uncertainty as the unknown, but instead, I submit that it is the force that <strong><em>shapes our body of knowledge</em></strong>. We perceive uncertainty as a threat to our unfolding potential, but I prefer to think of it as that which <strong><em>enables our agency</em></strong>. We think of uncertainty as an obstacle to innovation, but it is the ultimate <strong><em>generator of creativity</em></strong>. Lastly, we often perceive it as a corrosive force, but I argue that it provides the connectivity that <strong><em>gives us meaning</em></strong>.</p>\n<p>With this framework in mind, and having disentangled the most common misperceptions about uncertainty in this branch, we are ready to jump into the next branch and explore the above mentioned domains in some depth. [knowledge], [agency], [creativity], and [meaning].</p>\n<hr>\n<h3 id=\"semanticmirrorsemanticmirror\">[[semantic-mirror|Semantic Mirror]]</h3>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:20.526Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b016",
    "layout": "page",
    "title": "Death",
    "subtitle": "Eros and Thanatos.",
    "file_name": "death",
    "parent_node": "metaphysics",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "metaphysics"
    ],
    "content": "<p>The deepest of metaphysical uncertainties is the encounter with our most formidable enemy. <strong><em>Death</em></strong>. We so dread the predictable demise of our ego, that we turn away from this terror, coiled around our hopes and expectations. The mere thought of this dark omen makes us long for defined spaces, predictable outcomes, and all things permanent and unmoving. It is here that our yearning for <strong><em>certainty</em></strong> is born. This is not limited to the mortality of our bodies. It encompasses the <em>little death</em>, the irreversibility of time. The transformation of each moment of the present into an immutable past. The relentless collapse of unfolding potential into historical actuality. </p>\n<p>Our relationship with death was a topic of speculation for Sigmund Freud, who picked up the idea from a paper by Sabina Spielrein.[1] In his early work, he gave a central role to the <strong><em>pleasure principle</em></strong>. The drive toward life affirming behaviors such as survival instincts, social cooperation, and sex. But this framework was challenged by his encounters with WWI veterans displaying signs of PTSD and substance abuse. He posited the existence of an opposing force, and named it <strong><em>death drive</em></strong> (Todestrieb).[2] For Freud, this duality of energies he called Eros (life) and Thanatos (death) better explained observations such as masochism, aggression, and the frequent re-enacting of traumatic experiences. From a modern perspective, this duality of life and death drives appears oversimplified at best. Our current understanding of the complex mechanisms underlying PTSD and addictive behavior do not require the existence of a death drive. They are the result of a complex interplay between biases in memory encoding, behavioral heuristics, and the modulating functions of neurotransmitters.</p>\n<p>But perhaps Freud's Eros and Thanatos can be a useful metaphor. A narrative that helps us grasp the dynamic, fitful, fluid, and often obscure nature of the <strong><em>Self</em></strong>. An inner universe of shifting alliances full of opponent processes and balances of power. We will discover the connection between uncertainty and the Self in the branch on [agency]. For now it is enough to highlight the primordial fear of death as a source of our <strong><em>metaphysical uncertainty</em></strong>.</p>\n<hr>\n<p>[1] SPIELREIN, S. (1994), Destruction as the Cause of Coming Into Being. Journal of Analytical Psychology, 39: 155-186.&nbsp;<a href=\"https://doi.org/10.1111/j.1465-5922.1994.00155.x\">https://doi.org/10.1111/j.1465-5922.1994.00155.x</a>\n[2] Sigmund Freud, \"Beyond the Pleasure Principle\" in&nbsp;<em>On Metapsychology</em>&nbsp;(Middlesex 1987), p. 316.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:21.412Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b022",
    "layout": "page",
    "title": "Elmyra Duff",
    "subtitle": "A metaphor for certainty.",
    "file_name": "elmyra",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>From this perspective, humanity shares a striking resemblance with <strong><em>Elmyra Duff</em></strong>. Elmyra is a cartoon character from the Warner Bros. television series Tiny Toon Adventures. She is a cute, redheaded girl who lives in a nice, suburban home and attends Acme Looniversity. She serves as the school nurse and loves animals above all. In her pleated skirt, white socks, and black shoes, she stalks the neighborhood looking for animals. When she encounters one, she picks it up and expresses her love by hugging it. Tight. Tighter. And tighter. Until life starts to drain out of the creature. Of course, this is not love. It is an obsession coupled with a pathological disregard for life. This is reflected in the many abandoned pet toys, doghouses, and kitty baskets strewn across Elmyra’s ghostly back yard. Elmyra wears a light blue bow in her hair. If you look close, you see that it is held together in the middle by a gerbil’s skull. I am haunted by the image of humanity as Elmyra. So obsessed with certainty, that we drain life from all that which we encounter. I am terrified by our craving for control and prediction, profit and growth. Our back yard strewn with decaying toys and abandoned houses. I am horrified by the ceremonial headgear we wear in this ritual of destruction. A crown adorned with the symbol of our lasting legacy on this planet: the skull.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:28.351Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b03d",
    "layout": "branch-head",
    "title": "First Principles",
    "subtitle": "How to think about uncertainty and where it comes from.",
    "file_name": "first-principles",
    "parent_node": "uncertain-universe",
    "num_child_nodes": 4,
    "visibility": true,
    "tags": [
      "branch-head",
      "meta"
    ],
    "content": "<p>This branch of the book is my attempt at sketching an outline of the topic of uncertainty. A general map of the domains most affected by uncertainty, as well as the many misconceptions we hold about this ambiguous feature. Because the space to cover is so vast, I have to break some rules. Instead of delving into each topic in-depth, I have to skip along the surface to cover enough area. You could say this is an exercise in pointillism, each dot condensed to a low-level representation of reality, crude and lacking in nuance. Yet, with some distance, patterns emerge from the fragments, and a bigger picture emerges when seen as a whole. </p>\n<p>Of course, by using this approach I court the charge of a grave intellectual crime: of knowing a little bit about many things. Of dealing with subjects without the requisite expertise. I openly admit to my guilt in this regard. However, I believe this to be a sin and not a crime. In fact, this may well be a reason for our current lack of understanding. The disjointed treatment of uncertainty in various intellectual silos has led to a fragmented and inadequate grasp of what uncertainty really <strong><em>is</em></strong>. </p>\n<p>Information theory, economics, physics, and computer science each define uncertainty in entirely different and mutually incompatible ways. This has led to a <strong><em>fractured</em></strong> understanding - a kaleidoscope of different epistemic lenses. The purpose of this book is to establish a common understanding for us to discuss uncertainty across domains. In order to achieve this, we first need to address the many misconceptions surrounding uncertainty. Before we can define what uncertainty <strong><em>is</em></strong>, we need to establish what uncertainty is <strong><em>not</em></strong>. Then we will explore the various roots, from which uncertainty affects our lives. That is the purpose of this branch.</p>\n<hr>\n<h3 id=\"firstprinciplesfirstprinciples\">[[first-principles|First Principles]]:</h3>\n<p>[[the-beast|The Beast]] - <em>Something absent.</em>\n[[equivocation|Equivocation]] -  <em>Expressing different meanings.</em>\n[[dimensions-of-uncertainty|Dimensions of Uncertainty]] - <em>Where it comes from.</em>\n[[semantic-mirror|Semantic Mirror]] - <em>A figure-ground reversal of perception.</em></p>",
    "child_nodes": [
      {
        "name": "the-beast",
        "num_grandchild_nodes": 5,
        "_id": "64c88918a437e7743e95b03e"
      },
      {
        "name": "equivocation",
        "num_grandchild_nodes": 7,
        "_id": "64c88918a437e7743e95b040"
      },
      {
        "name": "dimensions-of-uncertainty",
        "num_grandchild_nodes": 4,
        "_id": "64c88918a437e7743e95b042"
      },
      {
        "name": "semantic-mirror",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b044"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:46.558Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b058",
    "layout": "page",
    "title": "Practical Certainty",
    "subtitle": "On the triangle of belief, trust, and choice.",
    "file_name": "practical-certainty",
    "parent_node": "equivocation",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "epistemic"
    ],
    "content": "<p>We can think of uncertainty as one of two polar opposites. After all, un-certain is simply the negation of <strong><em>certain</em></strong>, right? If we know what certainty is, then uncertainty is simply the opposite. This simple argument is appealing, but it rests on the assumption that we know what certainty <strong><em>is</em></strong>. But do we? As we have seen in the page on ignorance, the last centuries have been marked by a tremendous loss of certainty in the sciences. An <strong><em>explosion of ignorance</em></strong> of sorts. Even the \"hard\" sciences of physics and mathematics have jettisoned the idea of absolute certainty. We have proof that if a sub-atomic particle's position is known, then its momentum must be uncertain (Schrödinger). If a formal whole-number system is consistent, then it must be incomplete (Gödel). This begs an important question: If there is no such thing as certainty, then what could be its opposite?</p>\n<p>You might argue that this question is sterile and academic. Mere echoes bouncing off wood-paneled walls in the seminar. You might argue that in daily life, we do not rely on absolute certainty. All we need is <strong><em>practical certainty</em></strong>, the ability to satisfice[1] based on the best available knowledge at a given time. In the absence of absolute certainty, we turn to the next best thing: <strong><em>Credence</em></strong>: A belief sufficiently trusted to form the basis of our life's choices. But this should give us pause. Credence, or practical certainty, is based on three fundamental concepts: <strong><em>belief</em></strong>, <strong><em>trust</em></strong>, and <strong><em>choice</em></strong>. This highlights the point that our actions are based not on certain knowledge, but on firmly held beliefs. Of the many beliefs we may hold, only a few are held with enough conviction to support our choices. These are the beliefs we endow with a magical property: trust. </p>\n<p>==add paragraph on justified true belief==</p>\n<p>This reveals that certainty is not a mechanical property of knowledge at all. It is something altogether more ghostly and esoteric. Certainty is the <strong><em>faith</em></strong> we place in our beliefs. An intangible affect we depend on for all our decision making. From this perspective, the nature of uncertainty comes into sharper view. Uncertainty is that which corrupts, corrodes, and consumes this faith. That which wears away the trust we grant our beliefs. It is a force that dissolves the habitual, reflexive mechanism of our decision-making. It is the destroyer of credence… and the creator of possibility.</p>\n<hr>\n<p>[1] Satisficing - https://en.wikipedia.org/wiki/Satisficing</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:17.423Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05a",
    "layout": "page",
    "title": "Layers",
    "subtitle": "Metric and subjective space.",
    "file_name": "layers",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>Space is measured in metric units by most, distributed along three cartesian axes x, y, and z. This is a useful tool, but there is much more to space than this. I could say that I am standing in a 8 by 12 by 4 meter hollow brick volume, observing a vertical two-dimensional matrix of dark brown colors, 4.572 by 2.667 meters in size. But that would be a poor description of my experience, while at the Tate Modern Gallery in London, enjoying Mark Rothko's \"<em>Black on Maroon</em>\" painting. It would not capture the visceral tension the painting evokes. The subtle warping of space and time that engulfs the canvas and the observer. </p>\n<p>Just as metric space can be warped by gravity, subjective space can be distorted by phenomenology. That is because our surroundings mediate our relationship with the world. By draping a <strong><em>layer</em></strong> of experience over metric space, we form a connection with reality. The space we inhabit is both, objective and subjective, metric and experienced, sacred and profane. Architects know well that space is not the collection of vertical and horizontal slabs of matter. They know the intimate bond between us and the spacial volumes we inhabit. Indigenous cultures across the globe erected their dwellings to represent the cosmos they inhabited. Their homes, cities, and sacred structures were a mirror of their personal, social, and mythological space. </p>\n<p>For example, the Southwest Native American tribes, such as the <strong><em>Hopi</em></strong>, Zuni, <strong><em>and</em></strong> Pueblo <strong><em>peoples</em></strong> traditionally live in multi-story adobe structures known as pueblos. The design of these pueblos reflects the tribes' belief in the interconnectedness of all things and their respect for the natural environment. Many pueblos are built in a circular shape, which represents the cyclical nature of life and the importance of community. The central plaza is often seen as the heart of the pueblo, where people gather for social and spiritual activities. In addition, the orientation of the pueblos is often aligned with the cardinal directions, reflecting the tribes' deep connection to the land and the natural world. The buildings are designed to blend in with the landscape and are often decorated with intricate murals and carvings that represent the tribes' history, culture, and beliefs.</p>\n<p>If we strip space of this layered quality, we submit ourselves to a profound uncertainty. The uncertainty that stems from having lost the connection between the world and ourselves.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:23.526Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b012",
    "layout": "page",
    "title": "Control",
    "subtitle": "The magic triangle of sovereignty, legitimacy, and control.",
    "file_name": "control",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Uncertainty manipulation is first and foremost done for the purpose of <strong><em>control</em></strong>. This control, the command over a coterie of people beyond the Dunbar number, requires many things. Authority, the manipulation of confidence and fear, as well as narratives of legitimacy. But most importantly, it requires something altogether more elusive. Something intangible and akin to magic. The idea of sovereignty. According to philologist George Dumézil, in Europe and Central Asia this sovereignty is manifested in a mythological duality: the magician-king and the jurist-priest. Varuna and Mitra, Týr and Odin, Minerva and Jupiter. Together, these symbols alter the structural arrangement of values, categories and ideas to form <strong><em>hierarchy</em></strong> - Greek for “rule of the priest”. Hierarchy orients each part to the whole and establishes the concept of authority. This process is more akin to magic because it manipulates symbols, narratives, and beliefs to create an illusion. Martin Gurri expresses this poignantly in “The Revolt of the Public”:</p>\n<blockquote>\n  <p>“Authority, as I use the term, flows from legitimacy, derived from monopoly. To some indeterminate degree, the public must trust and heed authority, or it is no authority at all. An important social function of authority is to deliver certainty in an uncertain world. It explains reality in the context of the shared story of the group. For this it must rely on persuasion rather than compulsion, since naked force is a destroyer of trust and faith. ( ) Like money and marriage, legitimacy exists objectively because vast numbers of the public agree, subjectively, that it does exist. If enough people change their minds, the authorizing magic is lost.” [1]</p>\n</blockquote>\n<p>Throughout human history, control was often top-down and upheld by force if required. But not always. There are plenty of examples of functioning societies without central authority.[2] That is because violence is not the source of authority. Authority is derived from <strong><em>legitimacy</em></strong>. That is why authority often basks in glory, dwells in symbolism, and shrouds itself in secrecy. Glory is a sign of domination over uncertainty, symbolism makes visible this <strong><em>intangible quality of legitimacy</em></strong>, and secrecy suppresses information to the contrary.&nbsp;This is where we stumble upon information as destroyer of trust, and powerful corrosive to authority. It is no coincidence that throughout history information was collected, held, and distributed exclusively by eunuchs, monks, mandarins, scribes, and satraps. They ensured the monopoly over knowledge, promoting narratives that cemented authority, and suppressing messages that eroded it. This partially explains the challenges to sense-making faced by modern societies in the digital age of universal access to a tsunami of information.</p>\n<p>The acknowledgment, understanding, and domestication of uncertainty should be a prerequisite for anyone in authority making decisions. However, the act of opening up to uncertainty, and the embrace of the world as complex, messy, and unpredictable runs counter to a highly sought-after quality among people making decisions. <strong><em>Confidence</em></strong>. Across human history, rulers, leaders, advisors, experts; they have all used the same parlor-trick, the same slight-of-hand to legitimize authority and privilege. The power to impose certainty. Of course, it is just a trick. Yet, we crave it. Like a moth to a flame, we are drawn to those who wield it.[3] This serves the magician by legitimizing dominance, but also serves the audience. Herein lies the dirty secret of all authority. Even when it is imposed by force, the subjects tacitly crave and embrace the certainty provided, in the hope that it will translate into control and predictability. At the root, control over social hierarchy is achieved by exploiting our collective fear of the uncertain and creating the illusion of certainty. These attempts at generating order for the sake of domination work by slowing down change and stabilize volatility in the system. Crucially, social functions of hierarchy, command, and control are attempts at obscuring uncertainty. It is a form of deception, intended to fix things in place. This <strong><em>uncertainty reduction</em></strong> is our desperate attempt to frieze time and space. To cast the world into fixed form. Our futile attempt to make it HOLD STILL. Only then, does the world fit our maps, models, and equations. Only once it stops moving. Inert. Lifeless.</p>\n<hr>\n<p>[1] Gurri, M. (2018). The revolt of the public and the crisis of authority in the New Millennium. Stripe Press. \n[2] Graeber, D. (2021). The Dawn of Everything: A New History of Humanity\n[3] Weber, M., &amp; Roth. (1997). The theory of social and economic organization. Free Press.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:27.829Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b049",
    "layout": "page",
    "title": "The Future",
    "subtitle": "The negative space of possibility.",
    "file_name": "future",
    "parent_node": "spacetime",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "spacetime"
    ],
    "content": "<p>Choice is about making predictions, and predictions are about the <strong><em>future</em></strong>. The time ahead is the most uncertain yet, and the reason for this is two-fold. First, we cannot know for sure what will happen, and second, our present actions continuously affect the future and change it. But this view is problematic, or at least something important is missing. When we think about the future, this thought is about a possibility. One that <strong><em>does not exist</em></strong> <strong><em>yet</em></strong>, and may never exist. So perhaps our understanding of time and causality is the wrong way around? Perhaps the <strong><em>possible future</em></strong> is somehow affecting the present. Something that is <em>not here yet</em>, influences the now. Terence Deacon calls these paradoxical qualities of existing with respect to something missing <strong><em>absential</em></strong> features. Goals, intentions, and ideas all have this obscure quality. They deal with the future that is not yet formed. They deal with the negative space that contains possibility. </p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:26.536Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b05d",
    "layout": "page",
    "title": "Relationship",
    "subtitle": "Our relationship with uncertainty over the ages.",
    "file_name": "relationship",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social"
    ],
    "content": "<p>Our relationship with uncertainty has undergone significant changes through the ages. In prehistoric times, we developed a manipulative approach to uncertainty. Animism's invocation of spirits and ancestors was an attempt to influence uncertainty by pleading for otherworldly assistance. The goal was to <strong><em>alter</em></strong> uncertainty for the purpose of societal wellbeing. Fertility rituals and offerings soliciting a good harvest are remnants of this old tradition.</p>\n<p>In the age of empires, state and religious authority perfected the practice of <strong><em>exploiting</em></strong> the relationship with uncertainty for the purpose of societal control. Authorities learned that the illusion of ordaining certainty was essential for their claim to legitimacy.</p>\n<p>In the last few centuries, and certainly since the enlightenment, we began our attempt to <strong><em>eliminate</em></strong> uncertainty outright. A new period began in which the scientific pursuit of certain knowledge attempted to banish uncertainty from our lives. This reductionist approach ushered in a world view in which absolute knowledge is the goal state for which uncertainty has to be overcome.</p>\n<p>Throughout humanity's stages of development, we have attempted to alter uncertainty through the use of magic, exploit it through the brute-force imposition of illusions, and exterminate it outright via reductionism. Perhaps humanity is finally mature enough to do what is hardest: to acknowledge the reality that uncertainty is always around, between, and within us. Irreducibly and permanently. It is a thread in the fabric of existence, woven into the reality of our lives. Instead of altering, exploiting, or eliminating it, we ought to participate in its power to create possibility. We must learn to domesticate and manage it, for it is the key to everything that lies in the future.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:27.397Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b063",
    "layout": "quote",
    "title": "Shoshana Zuboff Quote",
    "subtitle": null,
    "file_name": "shoshana-zuboff-quote",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "quote"
    ],
    "content": "<blockquote>\n  <p>“Social trust is highly correlated with peaceful collective decision making and civic engagement. In its absence, the authority of shared values and mutual obligations slips away. The void that remains is a loud signal of societal vulnerability. Confusion, uncertainty, and distrust enable power to fill the social void\"</p>\n</blockquote>\n<p>~ Zuboff, Shoshana. The age of surveillance capitalism : the fight for a human future at the new frontier of power. London: Profile Books, 2019. Print.</p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:28.778Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b064",
    "layout": "section-head",
    "title": "Spacetime",
    "subtitle": "The past and the present.",
    "file_name": "spacetime",
    "parent_node": "dimensions-of-uncertainty",
    "num_child_nodes": 11,
    "visibility": true,
    "tags": [
      "section-head"
    ],
    "content": "<p>With the possible exception of deductive inference (pure logic), our choices interact with the dimension of <strong><em>time</em></strong>. Observations of the <strong><em>past</em></strong> are used to choose actions in the <strong><em>present</em></strong> in order to affect a favorable <strong><em>future</em></strong>. This dynamic dalliance with time is another primary root of uncertainty. Our knowledge of the past is dubious, our choices in the present are fickle, and our predictions of the future are unreliable at best. This entanglement with time is important because it affects our beliefs about the past, our actions in the present, and our expectations about the future. All of these are imperfect, dynamic, volatile, and ever uncertain. As they should be. In this section, we will explore the entanglement of uncertainty with time and space.</p>\n<hr>\n<h3 id=\"spacetimespacetime\">[[spacetime|Spacetime]]</h3>\n<blockquote>\n  <p>[[space|Space]] - <em>Micro-localized perspective.</em>\n  [[first-person-shooter|First Person Shooter]] - <em>Spacio-temporal fragments of hyperobjects.</em>\n  [[layers|Layers]] - <em>Metric and subjective space.</em>\n  [[lebbeus-woods-quote|Lebbeus Woods Quote]]\n  [[dennis-lindley-quote|Dennis Lindley Quote]]\n  [[past|Past]] - <em>Re-interpreting bygones.</em>\n  [[james-carse-quote|James Carse Quote]]\n  [[present|Present]] - <em>Clock time and lived time.</em>\n  [[reflection-at-sea|Reflection at Sea Poem]]\n  [[future|Future]] - <em>The negative space of possibility.</em>\n  [[terence-deacon-quote|Terence Deacon Quote]]</p>\n</blockquote>",
    "child_nodes": [
      {
        "name": "space",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b065"
      },
      {
        "name": "first-person-shooter",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b067"
      },
      {
        "name": "layers",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b069"
      },
      {
        "name": "lebbeus-woods-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b06b"
      },
      {
        "name": "dennis-lindley-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b06d"
      },
      {
        "name": "past",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b06f"
      },
      {
        "name": "james-carse-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b071"
      },
      {
        "name": "present",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b073"
      },
      {
        "name": "reflection-at-sea",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b075"
      },
      {
        "name": "future",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b077"
      },
      {
        "name": "terence-deacon-quote",
        "num_grandchild_nodes": 0,
        "_id": "64c88918a437e7743e95b079"
      }
    ],
    "marginalia": [],
    "lastModified": "2023-08-01T04:47:58.605Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  },
  {
    "_id": "64c88918a437e7743e95b098",
    "layout": "image",
    "title": "The Uncertainty Continuum",
    "subtitle": "Our attitude towards uncertainty across domains.",
    "file_name": "uncertainty-continuum",
    "parent_node": "society",
    "num_child_nodes": 0,
    "visibility": true,
    "tags": [
      "social",
      "diagram"
    ],
    "content": "<p>![[uncertainty-continuum.001.png]]\nThe social functions mentioned in this section are mediated by their attitude toward uncertainty. They exist on a continuum between two extreme poles: on one side, the attempt is made to flat-out deny or eliminate uncertainty. On the other side, uncertainty is actively embraced and utilized. This maps to the functions of control and authority on one side and culture and creativity on the other. </p>",
    "child_nodes": [],
    "marginalia": [],
    "lastModified": "2023-08-01T04:30:31.773Z",
    "node": {
      "num_grandchild_nodes": 0
    }
  }
]